
{
  "title": "Nigeria Tax Act, 2025",
  "act_number": "7",
  "commencement_date": "1st January, 2026",
  "chapters": [
    {
      "title": "CHAPTER ONE – OBJECTIVE AND APPLICATION",
      "sections": [
        {
          "number": "1",
          "title": "Objective",
          "content": "The objective of this Act is to provide a unified fiscal legislation governing taxation in Nigeria."
        },
        {
          "number": "2",
          "title": "Application",
          "content": "This Act applies throughout Nigeria to any person required to comply with any provision of the tax laws whether personally or on behalf of another person."
        }
      ]
    },
    {
      "title": "CHAPTER 2 – TAXATION OF INCOME OF PERSONS",
      "parts": [
        {
          "title": "PART 1 – IMPOSITION OF TAX ON INCOME, PROFITS OR GAINS",
          "sections": [
            {
              "number": "3",
              "title": "Imposition of tax",
              "content": "Income tax shall be determined in accordance with the provisions of this Act, and imposed on the –",
              "subsections": [
                {
                  "letter": "a",
                  "content": "profits or gains of any company or enterprise ;"
                },
                {
                  "letter": "b",
                  "content": "income of any individual or family; and"
                },
                {
                  "letter": "c",
                  "content": "income arising, accruing or due to a trustee, or an estate."
                }
              ]
            },
            {
              "number": "4",
              "title": "Income, profits or gains chargeable to tax",
              "subsections": [
                {
                  "number": "1",
                  "content": "Income, profits or gains of a person accruing in or derived from Nigeria, including –",
                  "clauses": [
                    { "letter": "a", "content": "profits or gains from any trade, business, profession or vocation for whatever period of time such trade or business may have been carried on;" },
                    { "letter": "b", "content": "royalties, fees, rents or interests arising from a right granted for the use, exploitation or occupation of any property;" },
                    { "letter": "c", "content": "dividends, premium, charges or annuities;" },
                    { "letter": "d", "content": "fees, dues, allowances, or any remuneration for services rendered;" },
                    { "letter": "e", "content": "discounts or rebates;" },
                    { "letter": "f", "content": "disposal of money or money instruments;" },
                    { "letter": "g", "content": "income, profits or gains from disposal or lending of securities;" },
                    { "letter": "h", "content": "prizes, winnings, honoraria, grants, awards, laurels, etc.;" },
                    { "letter": "i", "content": "profits or gains from the disposal of property or fixed assets;" },
                    { "letter": "j", "content": "profits or gains from transactions in digital or virtual assets; and" },
                    { "letter": "k", "content": "any other income, profit or gain not falling within the preceding categories." }
                  ]
                },
                { "number": "2", "content": "Income, profits or gains of an individual, including –", "clauses": [ { "letter": "a", "content": "salaries, wages, fees, allowances, compensations, bonuses, premiums, benefits or other perquisites allowed, given or granted by any person to any employee other than payment for expenses incurred in the performance of the duties of the employment, and from which it is not intended that the employee should make any profit or gain; and" }, { "letter": "b", "content": "any pension, annuity or any other similar income." } ] },
                { "number": "3", "content": "Income of a family recognised under any law or custom in Nigeria as family income in which the several interests of individual members of the family cannot be separately determined, excluding income on inherited assets before distribution." },
                { "number": "4", "content": "Income arising to a trustee of any settlement or trust, or estate or to an executor of any estate of a deceased person." },
                { "number": "5", "content": "Any other income, profit or gain not falling within the preceding categories." },
                { "number": "6", "content": "For the purposes of this section –", "clauses": [ { "letter": "a", "title": "interest", "items": [ { "number": "i", "content": "accrues in Nigeria where the liability to its payment falls upon a resident of Nigeria or Nigerian permanent establishment of a non-resident person regardless of where or in what form the interest is paid," }, { "number": "ii", "content": "includes, penal interests and any payment similar to interest, income from any government or corporate securities, bonds or debentures, premiums or prizes attaching to such securities, bonds or debentures, discounts, fees, premium, share of profit in non-interest finance arrangements, finance cost element in a finance lease, or foreign exchange differences arising in relation to securities, any payment in relation to derivatives used in hedging securities, or any other payment of similar nature," }, { "number": "iii", "content": "in respect of debts, includes return on discounted papers, income from debt claims of every kind, whether or not secured by mortgage and whether or not carrying a right to participate in the debtor's profits or foreign exchange differences arising in relation to a debt, and" }, { "number": "iv", "content": "in respect of regulated securities lending transactions, includes compensating payments received by a borrower from its approved agent or a lender, provided that the underlying transaction giving rise to the compensating payment is a receipt of interest by a lender on the collateral it received from its approved agent or a borrower;" } ] }, { "letter": "b", "title": "dividend", "content": "includes, in relation to -", "items": [ { "number": "i", "content": "a company that is not in the process of being wound up or liquidated, profits, in any form, shared or distributed to the shareholders, including an amount equal to the nominal value of bonus shares, debentures or securities awarded to the company's shareholders," }, { "number": "ii", "content": "a company that is being wound up or liquidated, any distribution, whether in money or money's worth, earned before or during the winding up or liquidation, and" }, { "number": "iii", "content": "regulated securities lending transaction, compensating payments received by a lender from its approved agent or borrower;" } ] }, { "letter": "c", "content": "\"royalty\" includes payments of any kind received or receivable, paid or payable as a consideration for the use of, or the right to use or exploit any property;" }, { "letter": "d", "content": "\"money instruments\" means instruments traded in money markets including government securities, treasury Acts, treasury or savings certificates, debenture certificates, commercial papers, certificates of deposits, call money, commercial Acts, treasury bonds and any other money instrument; and" }, { "letter": "e", "content": "the transfer of securities or shares under a regulated securities lending transaction shall not amount to a disposal, provided that such securities or shares are transferred from a lender and subsequently returned by the borrower to the lender." } ] }
              ]
            },
            {
              "number": "5",
              "title": "Chargeability to tax",
              "subsections": [
                { "number": "1", "content": "A company may be charged to tax –", "clauses": [ { "letter": "a", "content": "in its own name;" }, { "letter": "b", "content": "in the name of any principal officer, attorney, factor, agent or representative of the company in Nigeria in the same manner or amount that the company would have been charged; or" }, { "letter": "c", "content": "in the name of its receiver, liquidator, or administrator, in the same manner or amount that the company would have been charged if no receiver, liquidator or administrator had been appointed." } ] },
                { "number": "2", "content": "An individual may be charged to tax –", "clauses": [ { "letter": "a", "content": "in the individual's name;" }, { "letter": "b", "content": "in the name of a family, trustee or estate; or" }, { "letter": "c", "content": "in the name of an administrator, or any attorney, agent or representative in Nigeria, in like manner and to like amount as such an individual would have been charged if no administrator, attorney, agent or representative had been appointed." } ] }
              ]
            }
          ]
        },
        {
          "title": "PART II – TAXATION OF RESIDENT PERSONS",
          "sections": [
            { "number": "6", "title": "Nigerian company", "subsections": [ { "number": "1", "content": "The profits of a Nigerian company are deemed to accrue in Nigeria wherever the profits arise and whether or not such profits have been brought into or received in Nigeria." }, { "number": "2", "content": "Where a foreign company which is controlled by a Nigerian company has not, in a year, distributed profits to its shareholders, the proportion of the profits of the controlled foreign company attributable to the Nigerian company, which could have been distributed without detriment to the company's business shall be construed as distributed and included in the profits of the Nigerian company for the purposes of subsection (1)." }, { "number": "3", "content": "Where the income tax paid by a non-resident company which is a subsidiary of a Nigerian company or a member of a multinational group of a Nigerian company in any year yields less than the minimum effective tax rate prescribed by this Act, the Nigerian parent company shall pay an amount to make that non-resident subsidiary's income tax equal to the minimum effective tax rate." }, { "number": "4", "content": "The Service shall provide detailed rules for the implementation of subsections (2) and (3)." } ] },
            { "number": "7", "title": "Nigerian dividends", "subsections": [ { "number": "1", "content": "Nigerian dividends include –", "clauses": [ { "letter": "a", "content": "dividend distributed by a Nigerian company, and shall be the gross amount of that dividend before any deduction; and" }, { "letter": "b", "content": "any amount of the undistributed profit of a Nigerian company, which is treated as distributed under the provisions of any law in Nigeria." } ] }, { "number": "2", "content": "The income from a dividend distributed by a Nigerian company is deemed to arise on the day on which payment of that dividend becomes due." } ] },
            { "number": "8", "title": "Profits of a company from certain dividends", "subsections": [ { "number": "1", "content": "A company shall include dividend income in its profits, gross of any tax paid or deducted at source." }, { "number": "2", "content": "Dividends received by a Nigerian company by way of shares of the paying company shall not be included in its profits chargeable to tax under this Act and shall not be subject to the deduction prescribed under section 51 of Nigeria Tax Administration Act, 2025." } ] },
            { "number": "9", "title": "Substitution of dividend for total profit", "subsections": [ { "number": "1", "content": "Where a Nigerian company declares dividend out of profits on which no tax is payable due to –", "clauses": [ { "letter": "a", "content": "there being no total profits, or" }, { "letter": "b", "content": "total profits which are less than the amount of dividend which it declared, whether or not the recipient of the dividend is a Nigerian company, the company paying the dividend shall be charged to tax at the rate prescribed in section 56 of this Act as if the dividend is the total profits of the company for the year of assessment to which the accounts, out of which the dividend is declared, relates." } ] }, { "number": "2", "content": "The provisions of subsection (1) shall not apply to –", "clauses": [ { "letter": "a", "content": "dividends declared out of the retained earnings of a company, to the extent that the profits or gains included in the retained earnings have been taxed under the provisions of this Act ;" }, { "letter": "b", "content": "dividends declared out of profits or gains that are exempt from income tax by this Act;" }, { "letter": "c", "content": "franked investment income as provided in this Act; or" }, { "letter": "d", "content": "distributions made by a real estate investment company to its shareholders from rental income and dividend income received on behalf of those shareholders, whether such dividends are paid out of profits of the year in which the dividend is declared or out of profits of previous reporting periods." } ] } ] },
            { "number": "10", "title": "Certain undistributed profits may be treated as distributed", "subsections": [ { "number": "1", "content": "Where a Nigerian company controlled by not more than five individuals has not distributed to its shareholders as dividend, profits made in any period for which accounts have been made up by such company, the Service may direct that the proportion of the profits of the company, which could have been distributed without detriment to the company's business, be construed as distributed." }, { "number": "2", "content": "The gross amount of profits construed as distributed under the provisions of subsection (1) shall constitute a taxable income in the hand of individual shareholders of the company in proportion to their shareholdings in the ordinary capital of the company on the day of deemed distribution." }, { "number": "3", "content": "Any direction by the Service under this section shall be made in writing, and be served on the company, and shall specify the –", "clauses": [ { "letter": "a", "content": "day to be taken for the purposes of this section;" }, { "letter": "b", "content": "gross amount of those profits so deemed to be distributed;" }, { "letter": "c", "content": "rate applied for the deduction at source, being the rate prescribed by Nigeria Tax Administration Act, 2025; and" }, { "letter": "d", "content": "net amount after the deduction at source." } ] }, { "number": "4", "content": "For the purposes of this section, the Service may give notice to any company, which it has reason to believe is controlled by not more than five individuals, requiring it to supply, within such time as contained in such notice, full particulars of its shareholders." }, { "number": "5", "content": "In the case of a limited liability partnership, all the profits of the partnership shall be deemed as distributed, and taxable income, proportionately, in the hands of the respective partners." }, { "number": "6", "content": "Any direction by the Service under this section with respect to the profits of any accounting period of a company shall be made not later than three years after the receipt by the Service of the duly audited accounts of the company for that period." }, { "number": "7", "content": "A company in respect of which a direction is made under this section, shall have a right of appeal in accordance with Chapter Two of Nigeria Tax Administration Act, 2025." } ] },
            { "number": "11", "title": "Partnership of companies", "subsections": [ { "number": "1", "content": "Where two or more companies carry out a trade or business in a partnership, joint venture or a similar arrangement in Nigeria, any income or profit arising therefrom shall constitute a source of profits and each company's share shall be taxed separately." }, { "number": "2", "content": "Where any of the companies in the partnership is a non-resident, its share of income or profit from the partnership is chargeable to tax under this Act." }, { "number": "3", "content": "In the case of partnership carried on in a country other than Nigeria, the partner that is taxable in Nigeria shall include its share of revenue and cost, or profits in its assessable profits for the relevant year of assessment, and shall supply to the tax authority, particulars of the determination of the revenue and cost, or profit, with necessary adjustments made in accordance with the relevant provisions of Chapter Two of this Act." }, { "number": "4", "content": "The provisions of this section shall not apply to any partnership engaged in petroleum operations under Chapter Three of this Act." } ] },
            { "number": "12", "title": "Resident individual", "content": "The income, gains or profits of an individual who is a resident of Nigeria are deemed to accrue in Nigeria and are chargeable to tax in Nigeria wherever they arise, and whether or not the income, profits or gains have been brought into or received in Nigeria." },
            { "number": "13", "title": "Employment income", "subsections": [ { "number": "1", "content": "The income, gain or profit from an employment is derived from Nigeria where –", "clauses": [ { "letter": "a", "content": "the employee is a resident of Nigeria ; or" }, { "letter": "b", "content": "the duties of the employment are wholly or partly performed in Nigeria and the remuneration is –", "items": [ { "number": "i", "content": "paid by, or on behalf of, an employer who is a resident of Nigeria," }, { "number": "ii", "content": "borne by a Nigerian fixed base, permanent establishment or any other form of taxable presence of a non-resident employer, or" }, { "number": "iii", "content": "not liable to tax in the employee's country of tax residence." } ] } ] }, { "number": "2", "content": "Notwithstanding the provisions of subsection (1)(b), the employment income of a non-resident employee shall not be taxed in Nigeria where the –", "clauses": [ { "letter": "a", "content": "employer is a start-up, or is engaged in technology-driven services or creative arts; and" }, { "letter": "b", "content": "the employment income is taxable in the employee's country of tax residence." } ] }, { "number": "3", "content": "The remunerations of an employee of the Government of Nigeria is derived from Nigeria where the employee performs the duties of that employment in a country which, under an agreement or diplomatic privileges, exempts the remuneration from tax." }, { "number": "4", "content": "Where the duties of an employment are wholly or mainly performed in Nigeria, the remuneration from the employment during any period of leave or temporary absence from Nigeria is derived from Nigeria." }, { "number": "5", "content": "Notwithstanding the provisions of this section, the remuneration of an individual from an employment is chargeable to tax in Nigeria where the individual is a –", "clauses": [ { "letter": "a", "content": "seafarer serving under articles which he had signed in Nigeria, or is performing a stand-by duty on-board a ship preparatory to his signing articles in Nigeria;" }, { "letter": "b", "content": "Nigerian and performs the duties of that employment in a foreign country, and that country exempts the remuneration from tax under an agreement or diplomatic arrangement to which Nigeria is a party; or" }, { "letter": "c", "content": "Nigerian and performs the duties of the employment in Nigeria for a foreign country or international organisation, and that remuneration is not subject to tax in any other country under an agreement or diplomatic arrangement to which Nigeria is a party." } ] }, { "number": "6", "content": "For the purposes of this section –", "clauses": [ { "letter": "a", "content": "\"financial technology\" means the development and use of software or technology as the primary and principal mode of providing financial solution or service;" }, { "letter": "b", "content": "\"shared services\" means services provided by a member of a group of companies solely and exclusively to the other members of the group;" }, { "letter": "c", "content": "\"startup\" means a Nigerian company granted start-up label under the Nigeria Startup Act, 2022 ; and" }, { "letter": "d", "content": "\"technology driven services\" means financial technology (fintech), shared services, computer software or application development, virtual learning or any other business that the Minister may designate, by Order published in the Official Gazette;" } ] } ] },
            { "number": "14", "title": "Benefits-in-kind", "subsections": [ { "number": "1", "content": "Where an employer incurs an expense in the provision of any benefit or perquisite, other than the provision of living accommodation to which this section relates, the following provisions shall apply –", "clauses": [ { "letter": "a", "content": "where any asset belonging to the employer is used wholly or partly in the making of such provisions, the employee is deemed to have earned annual benefit of an amount equal to 5% of the amount expended by the employer in acquiring the asset, but if that amount cannot be so ascertained, 5% of the market value of the asset at the time of the acquisition, as may be determined by the relevant tax authority;" }, { "letter": "b", "content": "where any sum by way of rent or hire is payable by the employer in respect of any such asset, the employee is deemed to have earned annual benefit of an amount equal to the annual amount of the rent or hire payable by the employer on the asset; and" }, { "letter": "c", "content": "in any other case, the employee is deemed to have earned annual benefits equal to the annual amount expended by the employer in connection with the benefit thereon." } ] }, { "number": "2", "content": "The amount of benefit under subsection (1)(a) shall be reduced by so much of any expense made by the employee in respect thereon." }, { "number": "3", "content": "The provisions of this section shall not apply to any expenses incurred by an employer –", "clauses": [ { "letter": "a", "content": "in connection with the provision of meals in any canteen in which meals are provided for the staff generally or meal vouchers for employees;" }, { "letter": "b", "content": "in the provision of any uniform, overall or other protective clothing, work tools or work equipment; or" }, { "letter": "c", "content": "in connection with change in place of residence of the employee by reason of a change of the employee's employment or place of exercising the employment." } ] }, { "number": "4", "content": "A reference in this subsection to expenses incurred in connection with any matter includes a reference to a proportion of any expenses incurred partly in connection with that matter." }, { "number": "5", "content": "A reference in this section to anything provided for an employee shall, unless the reference is expressly to something provided for the employee, be construed as including a reference to anything provided for the spouse, family, servant, dependant or guest of that employee by the employer." }, { "number": "6", "content": "Where premises in Nigeria are made available by an employer to the employee, the spouse or family, and the employee –", "clauses": [ { "letter": "a", "content": "pays no rent for the premises , or" }, { "letter": "b", "content": "pays a rent less than the annual rental value of the premises, the employee shall be treated as being in receipt of additional emoluments equal to the annual rental value of the premises, subject to a maximum of 20% of annual gross income from the employment, excluding the rental value." } ] }, { "number": "7", "content": "In this section, \"annual value of the premises\" means –", "clauses": [ { "letter": "a", "content": "in relation to premises that are subject to a law governing assessment of local rates, the annual rental value of the premises as determined for the purposes of local rates under that law;" }, { "letter": "b", "content": "in any other case, the annual rental value as determined by the relevant tax authority; and" }, { "letter": "c", "content": "a reference in this section to annual value shall include a reference, where applicable, to such proper proportion of the annual value in relation to –", "items": [ { "number": "i", "content": "a period of occupation within a year," }, { "number": "ii", "content": "the part of the premises occupied, or" }, { "number": "iii", "content": "both a period of occupation within a year and the part of the premises occupied, as may be determined by the relevant tax authority." } ] } ] } ] },
            { "number": "15", "title": "Partnership of individuals", "subsections": [ { "number": "1", "content": "The gains or profits of a partner from a partnership shall be the sum of –", "clauses": [ { "letter": "a", "content": "any remuneration, interest on capital, cost of passages wholly or mainly undertaken for the purpose of leave or recreation, or any other perquisite or benefits in kind which is charged to the partnership accounts in respect of that partner; and" }, { "letter": "b", "content": "the partner's share in the profits of the partnership, computed in accordance with Chapter two of this Act, after the deduction of charges to which paragraph (a) applies in respect of all the partners: Provided that in arriving at the gains or profits of a partnership, private or domestic expense of a partner shall not be deducted." } ] }, { "number": "2", "content": "Where the income computed under subsection (1) (b) results in a loss for the partnership, the partner's share of the loss shall be deducted from the gains or profits ascertained under the provisions of subsection (1) (a) and the partner shall be deemed to have incurred a loss in the trade or business of the partnership to the extent, if any, by which the deductible share of loss exceeds those gains or profits." }, { "number": "3", "content": "For the purpose of subsection (1), a partner's share of the partnership's profits or losses shall be determined in the proportion specified in the partnership agreement as if the entire profits or losses were distributed among the partners, and where there is no partnership agreement, the profits or loss of the partnership shall be distributed equally among the partners: Provided that any person, whether resident or non-resident, who shares in the profits of a Nigerian partnership shall file returns in his name and pay the applicable tax." }, { "number": "4", "content": "The gains, profits or losses of a partner for any period, ascertained under this section, shall be deemed, for the purposes of Chapter Two of this Act, to be the partner's income or loss from a trade, business, profession or vocation carried on during that period, and the provisions of section 20 of this Act shall not apply." }, { "number": "5", "content": "The determination of the profits or losses that is attributable to a partner from a partnership shall be made by the relevant tax authority in relation to that partnership, and where any partner is taxable for a year of assessment in the territory of another relevant tax authority, the relevant tax authority in relation to that partnership shall make available to that other tax authority, particulars of the determination of profits or losses." }, { "number": "6", "content": "The income of a partner from a partnership in Nigeria shall be attributable to relevant territories in Nigeria in accordance with the Twelfth Schedule to this Act." }, { "number": "7", "content": "The partner, employee or agent in charge of the principal office or place of business of a partnership in Nigeria shall, without notice or demand, register or cause to be registered with the relevant tax authority, a certified copy of the partnership deed or, where no written deed is in existence, particulars of any written or oral agreement under which the partnership exists, and where any such particulars have been registered, a notice of any change in the agreement shall be registered with that tax authority within 30 days of the change." }, { "number": "8", "content": "Where the particulars of a partnership have been registered under the provisions of subsection (7), the computation of the gains or profits of a partner, may be made by the relevant tax authority on the basis of those particulars as they apply at any relevant time." }, { "number": "9", "content": "Where the particulars of a partnership are not registered, in compliance with subsection (7), tax may be assessed and charged by the relevant tax authority as though the whole gains or profits of such partnership accrued to any individual partner or were divisible between the partners, as may appear just and reasonable to that tax authority." } ] },
            { "number": "16", "title": "Settlements, trusts and estates", "content": "The income of an individual, a trustee or executor from a settlement, trust, or estate of a deceased person, made, created or administered in or outside Nigeria, shall be ascertained in accordance with the provisions of the Fifth Schedule to this Act." }
          ]
        },
        {
          "title": "PART III – TAXATION OF NON-RESIDENT PERSONS",
          "sections": [
            { "number": "17", "title": "Non-Resident person", "subsections": [ { "number": "1", "content": "The income, profits or gains of a non-resident person accruing in, or derived from Nigeria are chargeable to tax in accordance with the provisions of this Act." }, { "number": "2", "content": "Gains derived by a non-resident person from disposal of chargeable assets are taxable in Nigeria where the gains relate to –", "clauses": [ { "letter": "a", "content": "a trade, business, profession or vocation carried on by the non-resident person in Nigeria;" }, { "letter": "b", "content": "any asset located in Nigeria; or" }, { "letter": "c", "content": "any asset deemed to be located in Nigeria under this Act." } ] }, { "number": "3", "content": "Profits derived from any trade, business, profession or vocation carried on by a non-resident person are taxable in Nigeria where –", "clauses": [ { "letter": "a", "content": "the person has a permanent establishment or significant economic presence in Nigeria to the extent that the profit is attributable to the permanent establishment or significant economic presence;" }, { "letter": "b", "content": "payment is made by a person resident in Nigeria or a permanent establishment of a non-resident person in Nigeria, in respect of services furnished from outside of Nigeria to a resident of Nigeria or a Nigerian permanent establishment of a non-resident person, except where the payment is made –", "items": [ { "number": "i", "content": "to an employee of the person making the payment under a contract of employment," }, { "number": "ii", "content": "by an individual for teaching in an educational institution or for teaching by an educational institution, or" }, { "number": "iii", "content": "by a foreign permanent establishment of a Nigerian resident and the expense is borne by that permanent establishment; or" } ] }, { "letter": "c", "content": "payment is made to that person by a person resident in Nigeria or a Nigerian permanent establishment of a non-resident person, in respect of insurance premiums or risks insured from the territory of Nigeria." } ] }, { "number": "4", "content": "Any amount deducted at source in accordance with section 51 of Nigeria Tax Administration Act, 2025 from the payments made for any of the activities mentioned in subsection (3) (b) and (c), shall be the final tax on that payment unless the person has a permanent establishment or significant economic presence in Nigeria to which the payment is attributable." }, { "number": "5", "content": "The income, profits or gains of a non-resident person that are attributable to its permanent establishment in Nigeria shall be ascertained in accordance with the provisions of this Act, subject to the following conditions –", "clauses": [ { "letter": "a", "content": "the permanent establishment shall be deemed to have the same credit rating as the non-resident company of which it is a permanent establishment;" }, { "letter": "b", "content": "the permanent establishment shall be deemed to have such equity and loan capital as it could reasonably be expected to have in accordance with section 191 of this Act ;" }, { "letter": "c", "content": "the taxable profits to be attributed to the permanent establishment shall include income arising from the –", "items": [ { "number": "i", "content": "sale of goods or merchandise of the same or similar kind as those sold through that permanent establishment, made directly to Nigeria by the non-resident person or its connected persons, and" }, { "number": "ii", "content": "furnishing of services or any other business activity carried on in Nigeria by the non-resident or its connected persons of the same or similar kind as those effected through the permanent establishment;" } ] }, { "letter": "d", "content": "deduction shall not be made in respect of any cost except it was incurred for and in the production of the taxable profits attributable to the permanent establishment; and" }, { "letter": "e", "content": "deduction shall not be allowed in respect of amounts paid or payable, by the permanent establishment to the non-resident person or any of its connected persons, by way of royalties, fees or similar payments in return for the use of patents or other rights, other than towards reimbursement of actual expenses." } ] }, { "number": "6", "content": "Where the total profits attributable to a permanent establishment or significant economic presence in Nigeria cannot be ascertained in accordance with subsection (5), the total profits shall be the amount resulting from applying the profit margin of the non-resident person to the total income generated from Nigeria." }, { "number": "7", "content": "Where the total profits attributable to the permanent establishment or significant economic presence in Nigeria is lower than an amount resulting from applying the profit margin of the non-resident person to the total income generated from Nigeria, the total profits shall be the amount resulting from applying the profit margin of the non-resident person to the total income generated from Nigeria." }, { "number": "8", "content": "Notwithstanding the provisions of subsections (6) and (7), the tax payable under this section shall not be less than the tax withheld at source under Nigeria Tax Administration Act, 2025, and where the income is not liable to a deduction of tax under Nigeria Tax Administration Act, 2025, 4% of the total income generated from Nigeria." }, { "number": "9", "content": "For the purposes of this section –", "clauses": [ { "letter": "a", "content": "a non-resident person is deemed to have a permanent establishment in Nigeria where the person –", "items": [ { "number": "i", "content": "has a place, in Nigeria, through which its business is wholly or partly carried on or at its disposal for the purposes of its business," }, { "number": "ii", "content": "operates a trade or business through a person in Nigeria authorised to conduct on its behalf, or on behalf of some other persons controlled by it, or which have a controlling interest in it," }, { "number": "iii", "content": "maintains a stock of goods or merchandise in Nigeria from which deliveries are made by a person on its behalf," }, { "number": "iv", "content": "solely or together with any other person, executes a project in Nigeria involving surveys, designs, deliveries, building, construction, assembly or installation, commissioning or decommissioning or any supervisory activity in connection with those activities, irrespective of any split or number of entities that performed any of the activities of the project and whether or not only part of the project was carried out in or outside Nigeria, or" }, { "number": "v", "content": "furnishes any service in Nigeria through employees, agents, subcontractors or other persons engaged by it for such purpose;" } ] }, { "letter": "b", "content": "a non-resident person shall, subject to any regulations that may be issued by the Minister to that effect, have a significant economic presence in Nigeria where the person transmits, emits or sends by itself or through other person, signals, sounds, messages, images or data of any kind by cable, radio, electromagnetic systems or any other electronic or wireless apparatus to Nigeria in respect of any activity, including electronic commerce, application store, high frequency trading, electronic data storage, online adverts, participative network platform, online payments, supply of user data, search engines, digital content services, online gaming, cloud computing, online teaching services, and profit can be attributable to such activity;" }, { "letter": "c", "content": "a non-resident person shall not be deemed to have a permanent establishment or significant economic presence in Nigeria solely by reason of employing persons resident in Nigeria, to the extent that the duties of such employment are not performed primarily for customers in Nigeria;" }, { "letter": "d", "content": "\"a place\" means any location in Nigeria, whether owned, rented, leased or otherwise available for the use of the person, irrespective of the length of time it is used and shall include –", "items": [ { "number": "i", "content": "a place of management," }, { "number": "ii", "content": "a branch," }, { "number": "iii", "content": "a sales outlet," }, { "number": "iv", "content": "an office," }, { "number": "v", "content": "a factory," }, { "number": "vi", "content": "a workshop," }, { "number": "vii", "content": "a mine, a well for crude oil, gas, bitumen, water or any other natural resource, a quarry or any other place of extraction or exploitation of natural resources, or any supervisory activity in connection to it," }, { "number": "viii", "content": "facilities, including vessel, any installation or structure, used in the exploration of natural resources, or any supervisory activity in connection with such facilities," }, { "number": "ix", "content": "a building, construction, assembly or installation site, or" }, { "number": "x", "content": "any place for performing supervisory activity or any service or activity; and" } ] }, { "letter": "e", "content": "\"profit margin\" of a person shall be the proportion of the earnings before interest and tax (EBIT) to income or revenue in its published audited financial statement, and in the case of persons that have no published financial statements for the period or are not required to publish financial statements, the profit margin as may be ascertained by the relevant tax authority from the published financial statements of a comparable company." } ] } ] },
            { "number": "18", "title": "Non-resident person engaged in shipping or air transport", "subsections": [ { "number": "1", "content": "Where a non-resident person carries on the business of transport by sea or air, and any ship or aircraft owned, leased or chartered by it calls at any port in Nigeria, the non-resident person is chargeable to tax on the profits arising from the carriage of passengers, mails, livestock or goods shipped from, or loaded into an aircraft or ship, in Nigeria." }, { "number": "2", "content": "The provisions of subsection (1) shall not apply to passengers, mails, livestock or goods which are brought into Nigeria solely for trans-shipment or for transfer from one aircraft to another or between an aircraft and a ship." }, { "number": "3", "content": "For the purposes of subsection (1), where the Service is satisfied that the tax authority of the country of residence of a non-resident person computes and assesses the profits of its resident that operates ships or aircraft to Nigeria on a basis not materially different from that prescribed in this Act, the total profits or loss derived from Nigeria for that period shall be determined, using -", "clauses": [ { "letter": "a", "content": "the ratio of profits or loss of the company, before any allowance by way of depreciation, of an accounting period to the gross revenue in respect of carriage of passengers, mails, livestock or goods (global adjusted profit ratio); and" }, { "letter": "b", "content": "ratio of allowances by way of depreciation for that period to the gross revenue by the company in respect of carriage of passengers, mails, livestock or goods (global depreciation ratio)." } ] }, { "number": "4", "content": "For the purposes of subsection (3), the total profits of a period shall be taken to be the proportion to the gross revenue in respect of the carriage of passengers, mails, livestock or goods shipped or loaded in Nigeria, which is determined by applying the -", "clauses": [ { "letter": "a", "content": "global adjusted profit ratio to the gross revenue in respect of the carriage of passengers, mails, livestock or goods shipped or loaded in Nigeria to arrive at the assessable profits; and" }, { "letter": "b", "content": "global depreciation ratio to the gross revenue in respect of the carriage of passengers, mails, livestock or goods shipped or loaded in Nigeria, in place of any allowances to be given under the provisions of Part I of the First Schedule." } ] }, { "number": "5", "content": "Where at the time of assessment, the provisions of subsections (3) and (4) cannot for any reason be satisfactorily applied, the total profits shall be -", "clauses": [ { "letter": "a", "content": "the amount resulting from multiplying the turnover generated from Nigeria by the profit margin as defined under section 17(9)(e) of this Act; or" }, { "letter": "b", "content": "the profits deemed to be derived from Nigeria, which, on the direction of the Service, shall be computed on a fair percentage of the gross revenue in respect of the carriage of passengers, mails, livestock and goods shipped from or loaded in Nigeria." } ] }, { "number": "6", "content": "For the purposes of this section, the tax payable by a person for any year of assessment shall not be less than 2% of the gross revenue in respect of the carriage of passengers, mails, livestock or goods shipped from, or loaded into an aircraft in Nigeria, which shall be computed, assessed and paid on monthly basis." }, { "number": "7", "content": "Notwithstanding any other provision of this Act, where a person to which this section applies files a tax return and does not provide a separate financial statement of the Nigerian operations, such person shall submit detailed gross revenue statements of its Nigerian operations, certified by one of its directors and its external auditors, and supported with the contract agreements." }, { "number": "8", "content": "The provisions of this section shall not apply to income or profits arising from leasing of vessels or containers, non-freight operations or any other incidental income, such income or profits are chargeable to tax under relevant provisions of this Act." }, { "number": "9", "content": "Regulatory agencies in the shipping and air transport, and other relevant sectors shall, as a condition to carry on business in Nigeria or obtaining any relevant approvals or permits, mandate all persons taxable under the provisions of this section to present the following –", "clauses": [ { "letter": "a", "content": "evidence of income tax filing for the preceding tax year;" }, { "letter": "b", "content": "tax clearance certificates, showing income taxes paid for the three preceding tax years; or" }, { "letter": "c", "content": "evidence of tax declaration and payment in respect of the intended carriage or shipment." } ] } ] },
            { "number": "19", "title": "Nigerian dividends received by Non-Resident persons", "subsections": [ { "number": "1", "content": "There shall be no further tax charged in respect of any dividend received by a non-resident from a Nigerian company other than tax deducted at source under the Nigeria Tax Administration Act, 2025." }, { "number": "2", "content": "Nothing in this Act shall confer on the non-resident or the Nigerian company paying the dividend, a right to repayment of tax paid under section 51 of the Nigeria Tax Administration Act, 2025" } ] }
          ]
        },
        {
          "title": "PART IV – ASCERTAINMENT OF PROFITS AND INCOME",
          "sections": [
            { "number": "20", "title": "Deductions Allowed", "subsections": [ { "number": "1", "content": "Except where the provisions of section 18 of this Act or Part IX of Chapter Two apply, for the purposes of ascertaining the profits or loss from any trade, business, profession or vocation under this Act, there shall be deducted all expenses for that period wholly and exclusively incurred in the production of the income, including –", "clauses": [ { "letter": "a", "content": "any sum payable by way of interest on debt employed in generating the income of the trade, business, profession or vocation, subject to the provisions of the Third Schedule to this Act;" }, { "letter": "b", "content": "rent and premiums, incurred during that period, in respect of land or building occupied for the purposes of generating the income;" }, { "letter": "c", "content": "any outlay or expenses incurred in respect of –", "items": [ { "number": "i", "content": "salary, wages or other remuneration paid to employees, and" }, { "number": "ii", "content": "cost to the company of any benefit or allowance provided to its employees;" } ] }, { "letter": "d", "content": "any expense incurred for repair of premises, plant, machinery or fixtures employed in acquiring the income, or for the renewals, repair or alteration of any implement, utensil or articles so employed;" }, { "letter": "e", "content": "any amount of expenditure incurred for establishing, preserving or defending title to or rights over an asset ;" }, { "letter": "f", "content": "any contribution to any staff pension, provident or other retirement benefits fund, society or scheme approved under the Pension Reform Act or any similar enactment in Nigeria ;" }, { "letter": "g", "content": "any expense proven to the satisfaction of the relevant tax authority to have been incurred, being damage to, or loss of stock or inventory of the trade, business, profession or vocation ;" }, { "letter": "h", "content": "bad or doubtful debts incurred in the course of a trade or business, notwithstanding that the debts were due and payable before the commencement of the basis period, being –", "items": [ { "number": "i", "content": "debts becoming bad during the said basis period other than bad debt incurred in respect of transaction with a related party, or" }, { "number": "ii", "content": "doubtful debts estimated in accordance with generally acceptable accounting principles and to the extent that it is proven, to the satisfaction of the relevant tax authority, that the debts in respect of which a deduction is claimed were incurred in the course of the company's business operations that produced the assessable profits," } ] }, { "letter": "i", "content": "any expense incurred by the trade, business, profession or vocation on research and development for the period;" }, { "letter": "j", "content": "any other expense incurred during any previous period for the purpose of such trade or business, or specifically for the period which the profits are being ascertained, provided that any expenditure incurred within six years prior to commencement of business which would have been deductible if incurred after commencement of business, shall be deemed to have been incurred on the first day of commencing the trade or business;" }, { "letter": "k", "content": "dividends or mandatory distributions made by a real estate investment company duly approved by the Securities and Exchange Commission, to its shareholders;" }, { "letter": "l", "content": "compensating payments made by a lender to its approved agent or a borrower in a regulated securities lending transaction, which qualify as interest under section 4 (6) (a) (ii) of this Act; or" }, { "letter": "m", "content": "any expense incurred by a person on assistive devices and disability-related products including hearing aids, wheelchairs, and braille materials." } ] }, { "number": "2", "content": "Notwithstanding the provision of subsection (1)(h), in determining bad or doubtful debts deductible -", "clauses": [ { "letter": "a", "content": "appropriate reduction shall be made in respect of any amount that had been allowed for deduction in any previous period in respect of the same debt; and" }, { "letter": "b", "content": "all sums recovered on account of sums previously written off or allowed for deduction in respect of bad or doubtful debts shall be added to the profits of the trade, business, profession or vocation in the period of recovery." } ] }, { "number": "3", "content": "Liability waived, released or recovered shall be included in the assessable profits or chargeable gains in accordance with section 193 of this Act." }, { "number": "4", "content": "Notwithstanding anything to the contrary contained in any law, an expense incurred in a currency other than the Naira may only be deducted to the extent of its Naira equivalent at the official exchange rate published by the Central Bank of Nigeria for the relevant date or period." } ] },
            { "number": "21", "title": "Deductions not allowed", "content": "A deduction shall not be allowed for the purposes of ascertaining the profits or income from any trade, business, profession or vocation in respect of –", "clauses": [ { "letter": "a", "content": "capital repaid or withdrawn from a trade, business, profession or vocation;" }, { "letter": "b", "content": "any expenditure of a capital nature;" }, { "letter": "c", "content": "domestic or private expense, or expenditure on assets not used for the purpose of trade, business, profession or vocation;" }, { "letter": "d", "content": "any sum recoverable under an insurance or contract of indemnity;" }, { "letter": "e", "content": "taxes on profit or incomes levied in Nigeria or elsewhere;" }, { "letter": "f", "content": "any payment to a savings, widows and orphans, pension, provident or other retirement benefit fund, society or scheme not approved under the Pension Reform Act or any similar enactment in Nigeria;" }, { "letter": "g", "content": "depreciation or impairment of any fixed asset, investment or an unrealised exchange difference on any item denominated in foreign currency;" }, { "letter": "h", "content": "any sum reserved out of profits subject to the provisions of section 20(1)(h) of this Act;" }, { "letter": "i", "content": "any payment to a connected person that is not consistent with the Transfer Pricing Regulations issued by the Service;" }, { "letter": "j", "content": "any expense incurred in deriving an income that is exempt from income tax;" }, { "letter": "k", "content": "any expense allowable as a deduction in determining chargeable gains under this Act;" }, { "letter": "l", "content": "penalty or fine imposed under any law;" }, { "letter": "m", "content": "any tax or penalty borne on behalf of another person;" }, { "letter": "n", "content": "any compensating payment made by a borrower, which qualifies as dividends under this Act, to its approved agent or to a lender in a regulated securities lending transaction;" }, { "letter": "o", "content": "any compensating payment made by an approved agent, which qualifies as interest or dividends under this Act, to a borrower or lender in a regulated securities lending transaction; or" }, { "letter": "p", "content": "any expense on which Value Added Tax is due under this Act but was not charged, or in the case of imported items, any expense on which the applicable import duty or levy was not paid." } ] }
          ]
        },
        {
          "title": "PART V – ASCERTAINMENT OF ASSESSABLE PROFITS AND INCOME",
          "sections": [
            { "number": "22", "title": "Basis for computing assessable profits for trade or business", "subsections": [ { "number": "1", "content": "Except as provided in this section, the profits of any trade, business, profession or vocation for each year of assessment (the assessable profits) shall be the profits of the accounting period immediately preceding the year of assessment from all sources." }, { "number": "2", "content": "Notwithstanding the provisions of subsection (1), the assessable profits of the first year of assessment for a new business, shall be the profits from the date in which such trade, business, profession or vocation commences in Nigeria to the end of the first accounting period." } ] },
            { "number": "23", "title": "Change in accounting date", "subsections": [ { "number": "1", "content": "Where a taxable person changes the date to which it usually computes its assessable profits, the basis period for the computation of the assessable profits for the relevant year of assessment shall be the period commencing from the first day after the basis period of the immediately preceding year of assessment up to the new date on which the account was made, and the assessable profits of subsequent years of assessments shall be computed on the basis of the new accounting period." }, { "number": "2", "content": "Where there is a change in the accounting date under subsection (1), the taxable person shall notify the relevant tax authority not later than 30 days before the usual due date of filing its income tax returns." } ] },
            { "number": "24", "title": "Cessation of trade or business", "subsections": [ { "number": "1", "content": "Where a trade, business, profession or vocation permanently ceases to carry on operations in Nigeria in an accounting period, the assessable profits for the relevant year of assessment shall be the amount of the profits from the beginning of the accounting period to the date of cessation and the tax shall be payable within six months from the date of cessation." }, { "number": "2", "content": "Where, after the date of cessation, the trade, business, profession or vocation, or its receivers or liquidators, receive or pay any sum which ought to have been included in or deducted from the profits of that trade or business if it had been received or paid prior to that date, such sum shall be deemed for the purposes of this Act to have been received or paid by the trade, business, profession or vocation on the last day before such cessation occurred and such sums shall be disclosed to the relevant tax authority within one month of the receipt or payment." }, { "number": "3", "content": "Where the provisions of subsection (2) apply, any additional assessment or claim for reduction of assessment or repayment of tax shall be made as may be necessary to give effect to the provisions, provided that the provisions of the Nigeria Tax Administration Act, 2025, relating to objections and appeals shall apply to the additional assessment or claim of reduction of assessment or repayment of tax under this subsection." }, { "number": "4", "content": "In the case of a deceased individual, where the personal representative after death, receives or pays any sum which would have been included in or deducted from the gains or profits from the trade, business, profession or vocation carried on prior to death, that sum shall be deemed for all purposes of this Act to have been received or paid by the deceased, on the last day prior to the death." } ] },
            { "number": "25", "title": "Continuity of trades", "content": "An individual carrying on a trade, business, profession or vocation, shall not be treated as having commenced or ceased to do so solely by reason of a change in the territory in which the individual is resident from one year to another, or by reason of becoming or ceasing to be a partner in a partnership if the nature of the trade carried on by that partnership is the same as that carried on before or after the individual became or ceased to be a partner." },
            { "number": "26", "title": "Basis for computing assessable income", "subsections": [ { "number": "1", "content": "With respect to income from an employment or pension, the assessable income of an individual shall be the amount of the income of the year of assessment." }, { "number": "2", "content": "For the purpose of subsection (1), income from an employment shall be deemed to arise from day to day except to the extent that it is derived from any bonus, commission or allowance payable on one occasion only or at intervals exceeding one month, and to that extent it shall be deemed to be income –", "clauses": [ { "letter": "a", "content": "of the day on which it is paid; or" }, { "letter": "b", "content": "where it is paid after the cessation of the employment, of the last day of the employment including any terminal benefit arising therefrom." } ] }, { "number": "3", "content": "With respect to disposal of a chargeable asset, the assessable income of an individual shall be the amount of the chargeable gains accruing from assets disposed during the year immediately preceding the year of assessment, except for chargeable gains accruing from the disposal of chargeable assets used in the individual's trade, business, profession or vocation, which shall be those disposed during the year immediately preceding the year of assessment." }, { "number": "4", "content": "Notwithstanding the foregoing provisions of this section, the assessable income of a trustee, or of an executor of the estate of a deceased individual, or of a beneficiary of a trust or estate for any year of assessment shall be the income of that person for the year preceding that year of assessment as determined under the provisions of the Fifth Schedule to this Act." } ] }
          ]
        },
        {
          "title": "PART VI – ASCERTAINMENT OF TOTAL PROFITS OF COMPANIES",
          "sections": [
            { "number": "27", "title": "Ascertainment of total profits of companies", "subsections": [ { "number": "1", "content": "The total profits of a company for any year of assessment, shall be the amount of its total assessable profits from all sources, including chargeable gains computed in accordance with Part VIII of Chapter Two, less the amount of any loss ascertained in accordance with subsection (6), and capital allowance in accordance with the provisions of Part I of the First Schedule to this Act." }, { "number": "2", "content": "The capital allowance to be deducted in accordance with the provisions of Part I of the First Schedule shall be the amount relating to the qualifying capital expenditure incurred in generating the assessable profits: Provided that where value added tax is due under this Act but not charged on an asset, or in the case of an imported item, where the applicable import duty or levy was not paid, the relevant expenditure shall not be eligible as a qualifying capital expenditure." }, { "number": "3", "content": "Where the qualifying capital expenditure is in relation to an asset that is only partly utilised in generating the assessable profits, the capital allowance on such qualifying capital expenditure shall be prorated and only the portion relating to the taxable income shall be allowed as a deduction." }, { "number": "4", "content": "The capital allowance computed shall not be prorated where the non-taxable income constitutes less than 10% of the total income of the company." }, { "number": "5", "content": "Notwithstanding the provisions of subsection (4), the portion of capital allowance attributable to priority activities of a company that enjoys economic development incentive under this Act shall be deducted only from the assessable profits of the priority business: Provided that –", "clauses": [ { "letter": "a", "content": "in no circumstances shall the aggregate loss deductions from the assessable profits or income exceed the amount of that loss;" }, { "letter": "b", "content": "loss can only be deducted from the trade or business in which the loss was incurred ;" }, { "letter": "c", "content": "the loss shall be deducted to the extent possible from the amount of the assessable profits of the first year of assessment after that in which the loss was incurred, and in subsequent years until the loss is fully recouped; and" }, { "letter": "d", "content": "the loss incurred during any year of assessment shall be computed, in accordance with the basis period provided in sections 22 to 25 of this Act." } ] }, { "number": "6", "content": "Notwithstanding subsection (5) or any provision of this Act, any loss incurred in any period from sales, disposal or any other transaction in digital assets shall only be deductible in determining the profits from the business relating to digital or virtual assets." } ] }
          ]
        },
        {
          "title": "PART VII – ASCERTAINMENT OF TOTAL INCOME OF AN INDIVIDUAL",
          "sections": [
            { "number": "28", "title": "Total income of an individual", "subsections": [ { "number": "1", "content": "The total income of an individual for any year of assessment is the taxable income less total deduction." }, { "number": "2", "content": "For the purposes of subsection (1) –", "clauses": [ { "letter": "a", "content": "taxable income is the aggregate amount of –", "items": [ { "number": "i", "content": "assessable profits from trade, business, profession or vocation ascertained in accordance with Part V of Chapter Two of this Act," }, { "number": "ii", "content": "employment income," }, { "number": "iii", "content": "income from investing activities," }, { "number": "iv", "content": "profits or income from any other source, and" }, { "number": "v", "content": "chargeable gains from the disposal of chargeable assets." } ] }, { "letter": "b", "content": "total deduction is the sum of –", "items": [ { "number": "i", "content": "any loss ascertained in accordance with subsection (2)," }, { "number": "ii", "content": "capital allowance in accordance with the provisions of Part I of the First Schedule to this Act," }, { "number": "iii", "content": "income of the individual that is exempt from tax under this Act, and" }, { "number": "iv", "content": "income of the individual on which the tax deducted at source under section 51 of Nigeria Tax Administration Act, 2025 is the final tax." } ] } ] }, { "number": "3", "content": "The loss to be deducted in arriving at the total income of an individual is –", "clauses": [ { "letter": "a", "content": "the amount of a loss incurred by the individual during the year or preceding year of assessment in a trade, business, profession or vocation; and" }, { "letter": "b", "content": "the amount of loss incurred on the disposal of a chargeable asset: Provided that –", "items": [ { "number": "i", "content": "in no circumstances shall the aggregate loss deductions from income exceed the amount of that loss," }, { "number": "ii", "content": "the loss shall be deducted as far as possible from assessable profit of a trade, business, profession or vocation of the first year of assessment after that in which the loss was incurred, and in subsequent years until the loss is fully recouped," }, { "number": "iii", "content": "the loss incurred during any year of assessment shall be computed, in accordance with the basis period contained in Part V of Chapter Two of this Act, and" }, { "number": "iv", "content": "any loss incurred in any period from sales, disposal or any other transaction in digital or virtual assets shall only be deductible against the profit or gain from digital or virtual assets." } ] } ] } ] },
            { "number": "29", "title": "Presumptive taxation", "content": "Notwithstanding any provisions of Chapter Two of this Act, where for all practical purposes, the income of a person chargeable to tax under this Act cannot be ascertained or records are not kept in such a manner as to enable proper assessment of income, then such person shall be assessed on such terms and conditions as may be prescribed by the Minister on the advice of the Joint Revenue Board in a regulation under a presumptive tax regime." },
            { "number": "30", "title": "Ascertainment of chargeable income of individuals", "subsections": [ { "number": "1", "content": "The chargeable income of an individual, is the total income of that individual ascertained under the provisions of section 28 of this Act, less eligible deductions." }, { "number": "2", "content": "For the purposes of this section –", "clauses": [ { "letter": "a", "content": "\"eligible deductions\" include payments made by the individual in a year of assessment in respect of –", "items": [ { "number": "i", "content": "the individual's contributions under the National Housing Fund," }, { "number": "ii", "content": "the individual's contributions under the National Health Insurance Scheme," }, { "number": "iii", "content": "the individual's contributions under the Pension Reform Act," }, { "number": "iv", "content": "interest on loans for developing an owner-occupied residential house," }, { "number": "v", "content": "annual amount of any annuity or premium paid by the individual during the year preceding the year of assessment in respect of insurance on his life or the life of his spouse, or contract for a deferred annuity on his own life or the life of his spouse; and" }, { "number": "vi", "content": "rent relief of 20% of annual rent paid, subject to a maximum of N500,000, whichever is lower, provided that the individual accurately declares the actual amount of rent paid and other relevant information as may be prescribed by the relevant tax authority ; and" } ] }, { "letter": "b", "content": "\"total income\" means total income as specified in section 28 of this Act." } ] } ] },
            { "number": "31", "title": "Deductions to be claimed", "content": "Deduction shall not be allowed under this Part to any person for a year of assessment, unless claimed in writing in such form as the relevant tax authority may prescribe." },
            { "number": "32", "title": "Proof of claims", "subsections": [ { "number": "1", "content": "The relevant tax authority may require a claimant to a deduction under section 30 (2) (a) of this Act to produce such documentary evidence as may be necessary in support of any claim and in the absence of such evidence, or where such evidence is inadequate, the relevant tax authority may refuse to allow the deduction or such part of the amount claimed." }, { "number": "2", "content": "Notwithstanding any provision of this Part, where –", "clauses": [ { "letter": "a", "content": "an individual fails to produce satisfactory documentary evidence in support of a claim under section 30 (2) (a) of this Act, any objection to an assessment or, to any rate at which tax is to be deducted, shall be accompanied by a copy of the available documentary evidence or a declaration that such required documentary evidence does not exist; and" }, { "letter": "b", "content": "an individual claims a deduction under this Act for a year of assessment, or produces evidence in support of a claim previously made but not admitted or not admitted in full by the relevant tax authority, such repayment, set-off of tax or reduction in any assessment shall be made so as to give effect to any amount or additional amount of the deduction as appropriate." } ] } ] }
          ]
        },
        {
          "title": "PART VIII – ASCERTAINMENT OF CHARGEABLE GAINS",
          "sections": [
            { "number": "33", "title": "Chargeable Gains", "subsections": [ { "number": "1", "content": "Gains accruing to any person in a year of assessment shall be chargeable to tax in accordance with the provisions of this Act." }, { "number": "2", "content": "Gains on which tax is to be assessed on any person shall be computed in accordance with the provisions of this Part." } ] },
            { "number": "34", "title": "Chargeable assets", "subsections": [ { "number": "1", "content": "Subject to exemptions as may be provided in Part I of Chapter Eight of this Act, all forms of property shall be chargeable assets for the purpose of this Part, whether situated in Nigeria or not, including –", "clauses": [ { "letter": "a", "content": "any form of asset, shares, options, rights, debts, digital or virtual assets and incorporeal property generally: Provided that gains accruing to a person on disposal of shares in any Nigerian company shall not be chargeable gains where the –", "items": [ { "number": "i", "content": "disposal proceeds, in aggregate, is less than 150,000,000 and the chargeable gain does not exceed 10,000,000 in any 12 consecutive months," }, { "number": "ii", "content": "shares are transferred between an approved borrower and a lender in a regulated securities lending transaction, or" }, { "number": "iii", "content": "proceeds from such disposal, notwithstanding the threshold in (i), are reinvested within the same year of assessment in the acquisition of shares in the same or other Nigerian companies, provided that tax shall accrue proportionately on the portion of the proceeds which are not reinvested in the manner stipulated in this subsection;" } ] }, { "letter": "b", "content": "any currency other than Nigerian currency; and" }, { "letter": "c", "content": "any form of property created by the person disposing of it or coming to be owned without being acquired." } ] }, { "number": "2", "content": "This section shall have effect, notwithstanding that the property is an asset in respect of which qualifying capital expenditure had been incurred under any provision of this Act." } ] },
            { "number": "35", "title": "Disposal of assets", "subsections": [ { "number": "1", "content": "For the purpose of this Act, there is a disposal of assets by a person where any sum is derived from a sale, lease, transfer, an assignment, a compulsory acquisition or any other disposition of assets, subject to any exemptions as may be provided in Chapter Eight of this Act." }, { "number": "2", "content": "Subsection (1) shall apply, notwithstanding that no asset is acquired by the person paying the sum, and in particular where the sum is –", "clauses": [ { "letter": "a", "content": "derived by way of compensation for any loss of office or employment;" }, { "letter": "b", "content": "received under a policy of insurance and the risk of any kind of injury or damage, or the loss or depreciation of assets;" }, { "letter": "c", "content": "received in return for forfeiture or surrender of a right, or for refraining from exercising a right; and" }, { "letter": "d", "content": "received as consideration for use or exploitation of any asset." } ] }, { "number": "3", "content": "In this Part –", "clauses": [ { "letter": "a", "content": "references to a disposal of assets include, references to a part disposal of assets; and" }, { "letter": "b", "content": "there is a part disposal of assets where –", "items": [ { "number": "i", "content": "an interest or right in or over the assets is created for another person by the disposal, and" }, { "number": "ii", "content": "a part of the interest in the property which subsists before the disposal remains with the person making the disposal." } ] } ] } ] },
            { "number": "36", "title": "Disposal of assets, provisions as to considerations", "subsections": [ { "number": "1", "content": "Subject to the provisions of this Act, the acquisition and disposal of an asset by a person shall be deemed to be for a consideration equal to the market value of the asset where the person acquires the asset –", "clauses": [ { "letter": "a", "content": "otherwise than by way of a bargain made at arm's length;" }, { "letter": "b", "content": "wholly or partly for a consideration that cannot be valued;" }, { "letter": "c", "content": "as trustee for creditors of the person making the disposal; or" }, { "letter": "d", "content": "upon devolution on death as a personal representative or legatee of a deceased." } ] }, { "number": "2", "content": "Where a person disposes of an asset by way of gift, other than asset acquired or disposed by devolution on death, the person acquiring the asset shall, as it relates to the interest taken by the person, be deemed to have acquired the asset –", "clauses": [ { "letter": "a", "content": "for a consideration equal to the amount for which the asset was last disposed of by way of a bargain made at arm's length; or" }, { "letter": "b", "content": "where the amount last disposed of by way of bargain made at arm's length cannot be ascertained, for a consideration equal to the market value of the asset on the date of that disposal." } ] }, { "number": "3", "content": "Where an asset is held by a person as a nominee or trustee for –", "clauses": [ { "letter": "a", "content": "another person absolutely entitled," }, { "letter": "b", "content": "an infant or a person with disability, or" }, { "letter": "c", "content": "two or more persons, the provisions of this Part shall apply as if the property were vested in, and the acts of the nominee or trustee in relation to the asset were the acts of the person or persons referred to in this subsection." } ] }, { "number": "4", "content": "Any acquisition of the asset referred to in subsection (3) by the nominee or trustee or the disposal of the assets to the nominee or trustee shall be disregarded." }, { "number": "5", "content": "The conveyance or transfer by way of security of an asset or of an interest or right in or over it, or transfer of a subsisting interest or right by way of security in or over an asset, including a re-transfer on redemption of the security, shall not be treated as involving any acquisition or disposal of the asset." }, { "number": "6", "content": "Any dealing with an asset by a person who has a security interest in it or who has the benefit of a charge against it or an encumbrance against it in order to enforce or give effect to those rights shall be deemed to have been made by that person in his capacity as that person's nominee." }, { "number": "7", "content": "An asset shall be treated as having been acquired free of any interest or right by way of security subsisting at the time of any acquisition of it, and as being disposed of free of any such interest or right subsisting at the time of the disposal, and where an asset is acquired subject to any such interest or right, the full amount of the liability thereby assumed by the person acquiring the asset shall form part of the consideration for the acquisition and disposal in addition to any other consideration." }, { "number": "8", "content": "Where an asset is acquired by a creditor in satisfaction of his debt or part of it –", "clauses": [ { "letter": "a", "content": "the asset shall not be treated as disposed of by the debtor or acquired by the creditor for a consideration greater than its market value at the time of the creditor's acquisition of it; and" }, { "letter": "b", "content": "chargeable gain accruing to the creditor on disposal of the asset shall not exceed the chargeable gain which would have accrued if he had acquired the property for a consideration equal to the amount of the debt or that part." } ] }, { "number": "9", "content": "In this section – \"legatee\" includes any person taking under a testamentary disposition or on an intestacy or partial intestacy, whether he is taken as a beneficiary or trustee, and a gift made in contemplation or condition of death shall be treated as a testamentary disposition and not as a gift; \"personal representatives\" means –", "clauses": [ { "letter": "a", "content": "the executor or the representative, or administrator for the time being of a deceased person under any law in force in Nigeria; or" }, { "letter": "b", "content": "persons who, under the law of another country, have functions corresponding to personal representatives as defined under paragraph (a)." } ] } ] },
            { "number": "37", "title": "Compulsory acquisition of land", "subsections": [ { "number": "1", "content": "A person shall not be charged to tax under this Act in respect of gains on any acquisition and disposal of land by reference to a disposal to an authority exercising or having compulsory powers, if that person had not –", "clauses": [ { "letter": "a", "content": "acquired the land at a time when he knew or might reasonably have known that it was likely to be acquired by the authority; or" }, { "letter": "b", "content": "taken any steps by advertisement or otherwise to dispose of the land or to make his willingness to dispose of it known to the authority or others." } ] }, { "number": "2", "content": "In this section, \"authority exercising or having compulsory powers\" means, in relation to any disposal of land, an authority, a person or body of persons acquiring the land compulsorily under the Land Use Act or any other similar enactment or law of a country other than Nigeria, or who has or have been, or may be authorised to acquire it compulsorily for the purposes for which it is acquired, or for whom another authority, person or body of persons has or have been, or may be authorised to acquire it." } ] },
            { "number": "38", "title": "Date of acquisition or disposal", "content": "Any asset acquired or disposed of by a person chargeable to tax shall, be deemed to have been acquired or disposed of at the date at which there is an enforceable right to acquire or a binding duty to dispose of the asset or any right or interest in it, and in particular, where –", "subsections": [ { "letter": "a", "content": "any contract is to be performed subject to any condition, the date of acquisition or disposal of the asset shall be the date the condition is satisfied;" }, { "letter": "b", "content": "consideration under the contract does not depend solely or mainly on the value of the asset at the time the condition is satisfied, the acquisition or disposal shall be treated as if the contract had never been conditional, in which case the date of the acquisition or disposal of the asset shall be the date of the contract; or" }, { "letter": "c", "content": "an option is conferred by virtue of any contract, the date of the acquisition or disposal of the asset shall be the date when the option is exercised." } ] },
            { "number": "39", "title": "Computation of chargeable gains", "content": "The gains chargeable to tax shall, subject to other provisions of this Act, be computed as follows –", "subsections": [ { "letter": "a", "content": "in the case of a disposal of an asset used for a trade, business, profession or vocation, for which capital allowance has been made in accordance with the First Schedule to this Act, only the residue of that asset shall be deducted from the disposal proceeds for the purposes of computing chargeable gains; and" }, { "letter": "b", "content": "where capital allowance has not been made in accordance with the First Schedule to this Act, the chargeable gain shall be determined by deducting from the disposal proceeds, the amount or value of the consideration, in money or money's worth incurred, wholly and exclusively for the acquisition of the asset." } ] },
            { "number": "40", "title": "Expenses incurred for disposal of chargeable assets", "content": "Any incidental cost incurred wholly and exclusively for the purpose of disposal of a chargeable asset is deductible from the disposal proceeds for the purposes of determining the chargeable gain." },
            { "number": "41", "title": "Part disposal", "subsections": [ { "number": "1", "content": "Where a part of an asset is disposed or where some property derived from an asset remains undisposed after a disposal of the asset –", "clauses": [ { "letter": "a", "content": "the acquisition cost of the assets, together with any expenditure wholly and exclusively incurred for the purpose of enhancing the value of the asset; or" }, { "letter": "b", "content": "the residue, in the case of assets used for trade or business on which capital allowance have been made in accordance with the First Schedule to this Act, shall be apportioned between the disposed part and the undisposed part." } ] }, { "number": "2", "content": "Apportionment shall be made by reference to –", "clauses": [ { "letter": "a", "content": "the amount or value of the consideration for the disposal on the one hand, referred to as \"A\"; and" }, { "letter": "b", "content": "the market value of the property which remains undisposed on the other hand referred to as \"B\"." } ] }, { "number": "3", "content": "The acquisition cost or residue of the disposed part shall be apportioned by applying the fraction A/(A+B), and the remainder shall be attributed to the part which remains undisposed." }, { "number": "4", "content": "Where a portion of interest or right in a chargeable asset is disposed, and some part of that asset or any description of property derived from the asset remains undisposed, the cost of acquisition in addition to any incidental cost of the acquisition, or residue of the asset, shall be apportioned based on the value of the sale compared to the market value of the undisposed portion." } ] },
            { "number": "42", "title": "Consideration due after time of disposal", "subsections": [ { "number": "1", "content": "Where the consideration or part of a consideration, taken into account in the computation of chargeable gains under section 39 of this Act, is payable by instalments over a period exceeding twelve months, beginning from the time when the disposal is made, the chargeable gain accruing on the disposal shall be regarded as accruing in proportionate parts in the period of assessment in which the disposal is made and in subsequent periods of assessments, until the last instalment is payable." }, { "number": "2", "content": "The proportionate parts to be recorded as accruing in the respective periods of assessment shall correspond to the proportions of the amounts of the instalments of consideration payable in those respective periods of assessment." }, { "number": "3", "content": "The time in the year or accounting period when any part of a chargeable gain is deemed to accrue under this section shall be the last day in that year of assessment, except in the case of cessation of a trade, business, profession or vocation, or death of the alienator, where such part shall be deemed to accrue on the date of cessation or death." }, { "number": "4", "content": "The provisions of subsection (1) shall not apply to any part of the consideration which has effectively passed to the person making the disposal by way of a loan made to that person by the other party to the transaction." }, { "number": "5", "content": "In the computation of chargeable gains under this section –", "clauses": [ { "letter": "a", "content": "consideration for the disposal shall, in the first instance, be brought into account without –", "items": [ { "number": "i", "content": "any adjustment for postponement of the right to receive any part of it, and" }, { "number": "ii", "content": "regard to a risk of any part of the consideration being irrecoverable, or to the right to receive any part of the consideration being contingent; and" } ] }, { "letter": "b", "content": "where any part of the consideration so brought into account is subsequently shown to the satisfaction of the relevant tax authority to be irrecoverable, such adjustment, whether by way of discharge, or repayment of tax or otherwise, shall be made as required." } ] } ] },
            { "number": "43", "title": "Assets lost or destroyed", "subsections": [ { "number": "1", "content": "Where an asset is lost or destroyed, and a capital sum received by way of compensation for the loss or destruction is applied within three years of receipt in acquiring another asset in its replacement, the owner shall, where the compensation received together with the residual or scrap value is –", "clauses": [ { "letter": "a", "content": "greater than the cost of the asset acquired in replacement of the lost or destroyed asset, be deemed to make a chargeable gain; and" }, { "letter": "b", "content": "lower than the cost of the asset acquired in its replacement, be deemed, for the purposes of the First Schedule to this Act, to have acquired an additional asset for an amount equal to the cost of that new asset, less the compensation together with the residual or scrap value." } ] }, { "number": "2", "content": "Except for the additional asset acquired under subsection (1)(b), allowance to be claimed on the new asset for the purposes of the First Schedule to this Act shall be limited to the residue of the old asset, if any." } ] },
            { "number": "44", "title": "Bargains comprising two or more transactions", "subsections": [ { "number": "1", "content": "Where a single bargain comprises two or more transactions whereby assets are disposed of, those transactions shall be treated for the purposes of computing chargeable gains as a single disposal." }, { "number": "2", "content": "Where separate considerations are agreed or purported to be agreed for any two or more transactions comprised in one bargain, whether transactions whereby assets are disposed of or not, those considerations shall be treated as altogether constituting an entire consideration for the transactions and shall be apportionable between them." }, { "number": "3", "content": "Where an apportionment under this section results in less consideration being attributed to the chargeable asset than that agreed or purported to be agreed, in the bargain, the separate considerations shall be the consideration for which those assets are disposed of." } ] },
            { "number": "45", "title": "Valuation at market value", "subsections": [ { "number": "1", "content": "For the purposes of computing chargeable gains, unless the context otherwise requires, market value, in relation to any asset, means the price which the asset might reasonably be expected to fetch on a sale conducted at arm's length, or in the open market." }, { "number": "2", "content": "In estimating the market value of any asset in the case of a disposal, no reduction shall be taken into account for cash or bulk discount." }, { "number": "3", "content": "In determining the acquisition cost of any asset, where the actual consideration paid by the acquirer is less than the market value, the assets shall be deemed to have been acquired for the amount actually paid." } ] },
            { "number": "46", "title": "Location of assets", "content": "For the purposes of Chapter Two of this Act –", "subsections": [ { "letter": "a", "content": "the situation of rights or interests, other than by way of security, in or over immovable property is that of the immovable property;" }, { "letter": "b", "content": "the situation of rights or interests, other than by way of security, in or over tangible movable property is that of the tangible movable property;" }, { "letter": "c", "content": "a debt, secured or unsecured, is situated in Nigeria where the creditor is resident in Nigeria, or has a permanent establishment in Nigeria to which the debt relates;" }, { "letter": "d", "content": "shares or securities issued by any governmental, municipal or local authority, or by a body created by such an authority, are situated in the country of that authority or place where the authority is situated;" }, { "letter": "e", "content": "subject to paragraph (d), registered shares or securities are situated where they are registered and, if registered in more than one register, where the principal register is situated;" }, { "letter": "f", "content": "notwithstanding paragraph (e), shares or comparable interests in any foreign entity are deemed to be located in Nigeria, if, at any time during the 365 days preceding the alienation, more than 50% of the value of the shares or other interests is derived, directly or indirectly –", "items": [ { "number": "i", "content": "through one or more interposed entities resulting in the change in direct or indirect ownership structure of a Nigerian entity, or" }, { "number": "ii", "content": "from immovable property or any other chargeable assets situated in Nigeria;" } ] }, { "letter": "g", "content": "subject to paragraph (d), shares or comparable interest in an entity is situated in Nigeria, if the entity is a Nigerian company or the owner of beneficial interest in the shares or comparable interest is resident in Nigeria or the owner has a permanent establishment in Nigeria to which the shares relates;" }, { "letter": "h", "content": "a ship or aircraft used in international traffic is situated in Nigeria where the owner is resident in Nigeria or the owner has a permanent establishment in Nigeria to which the ship or aircraft relates;" }, { "letter": "i", "content": "interest or right in or over a ship or aircraft used in international traffic is situated in Nigeria where the person entitled to the interest or right is resident in Nigeria or has a permanent establishment in Nigeria to which the interest or right relates;" }, { "letter": "j", "content": "the situation of goodwill of a trade, business or professional asset is at the place where the trade, business or profession is carried on;" }, { "letter": "k", "content": "patents, trademarks or designs are situated where they are registered, and if registered in more than one register, where each register is situated;" }, { "letter": "l", "content": "copyright, franchises, rights or licences to use any copyright material, patent, trademark, or design are situated in Nigeria where they, or any rights derived from them, are exercisable in Nigeria;" }, { "letter": "m", "content": "a judgement debt is situated where the judgement is recorded; and" }, { "letter": "n", "content": "notwithstanding paragraphs (k) and (l), incorporeal property including digital assets are situated in Nigeria where the person who holds direct or indirect beneficial ownership, control or interest over the right or property is resident in Nigeria or has a permanent establishment in Nigeria to which the property is connected." } ] },
            { "number": "47", "title": "Indirect transfer of ownership of companies or assets", "content": "Gains accruing to any person in respect of a disposal of shares by a non-resident shall be a chargeable gain under this Act where the disposal results into a change –", "subsections": [ { "letter": "a", "content": "in the ownership structure or group membership of any Nigerian company; or" }, { "letter": "b", "content": "of ownership of, title in, or interest in any asset located in Nigeria." } ] },
            { "number": "48", "title": "Life assurance policies", "subsections": [ { "number": "1", "content": "This section has effect in respect to any policy of assurance or contract for a deferred annuity on the life of any person." }, { "number": "2", "content": "Chargeable gain shall not accrue on the disposal of an interest in, or the rights under any such policy of assurance or contract, except where the person making the disposal is not the initial beneficial owner and acquired the rights or interests for a consideration in money or money's worth." }, { "number": "3", "content": "Subject to subsection (2), the surrender of a policy of assurance or the rights under a contract for a deferred annuity shall constitute a disposal of the rights under the policy of assurance or contract for a deferred annuity, and the amount of the consideration for the disposal of a contract for a deferred annuity shall be the higher of the market value and the disposal proceeds." } ] },
            { "number": "49", "title": "Rights under policies of insurance, other than life assurance policies", "subsections": [ { "number": "1", "content": "The rights of the insured under an insurance effected in the course of a capital redemption business or industrial assurance business shall constitute an asset which may yield a chargeable gain upon disposal." }, { "number": "2", "content": "The rights under any other policy of insurance, whether the risks insured relate to property or not, shall not constitute an asset on the disposal of which a chargeable gain may accrue, except as may be expressly provided under this Part." }, { "number": "3", "content": "In this section –", "clauses": [ { "letter": "a", "content": "\"capital redemption business\" means the business of effecting and carrying out contracts of insurance, whether effected by the issue of policies, bonds or endowment certificates or otherwise, whereby, in return for one or more premiums paid to the insurer a sum or a series of sums is to become payable to the insured in the future, excluding life or industrial assurance business;" }, { "letter": "b", "content": "\"industrial assurance business\" means the business of effecting and carrying out contracts of insurance in connection with any industrial assurance whereby in return for one or more premiums paid to the insurer a sum or a series of sums is to become payable to the insured in the future; and" }, { "letter": "c", "content": "\"policy of insurance\" does not include a policy of assurance on human life." } ] } ] },
            { "number": "50", "title": "Personal injury", "subsections": [ { "number": "1", "content": "Sums not exceeding 50,000,000 obtained by way of compensation or damages for any wrong or injury suffered by an individual in his person or in his profession or vocation, including compensation for loss of office or employment, wrong or injury for libel, slander or enticement shall not be chargeable gains." }, { "number": "2", "content": "Where the sum exceeds 50,000,000, only the excess amount shall constitute a chargeable gain." }, { "number": "3", "content": "For the purposes of subsection (1) and (2), any person who pays compensation for loss of office or employment to an individual is required, at the point of payment of such compensation, to deduct and remit the tax due under this section to the relevant tax authority." }, { "number": "4", "content": "The tax so deducted shall be remitted within the time specified under the Pay-As-You-Earn or Deduction of Tax at Source Regulations issued pursuant to the Nigeria Tax Administration Act, 2025." } ] },
            { "number": "51", "title": "Principal private residences", "subsections": [ { "number": "1", "content": "The gains accruing to an individual are exempt from tax in respect of the disposal of, or an interest in –", "clauses": [ { "letter": "a", "content": "a dwelling-house or part of such dwelling-house; and" }, { "letter": "b", "content": "land, other than land used for commercial purposes, immediately adjoining the dwelling house up to a maximum of one acre." } ] }, { "number": "2", "content": "The exemption under this section shall be enjoyed once in the lifetime of an individual." }, { "number": "3", "content": "The consideration shall be apportioned where a person disposes of only a part of a dwelling-house or a house used partly as dwelling place and partly for carrying out a trade, business, profession or vocation." } ] },
            { "number": "52", "title": "Personal chattels", "subsections": [ { "number": "1", "content": "A gain accruing on a disposal of an asset which is tangible movable property being personal chattels of an individual shall not be a chargeable gain if the total amount or value of the consideration for the disposal does not, in a period of assessment, exceed 5,000,000 or three times the annual national minimum wage, whichever is higher." }, { "number": "2", "content": "Where two or more assets, whether or not forming part of a set of articles, are disposed by a person to the same person or to persons acting in concert or to connected persons, whether on the same or different occasions, the two or more transactions shall be treated as a single transaction disposing of a single asset, but with any apportionments, where necessary." }, { "number": "3", "content": "Where the disposal is part of a right or interest in, or over tangible movable property, subsection (1) shall apply in relation to the asset as a whole, taking the consideration as including the market value of what remains undisposed of, in addition to the actual consideration." }, { "number": "4", "content": "The provisions of this section shall apply to a gain accruing on a disposal of two or more assets, not necessarily forming part of a set of articles of any description, which are tangible movable properties in the same manner as they apply in relation to a gain accruing on a disposal of an asset, or two or more assets forming part of a set of articles." }, { "number": "5", "content": "This section shall not apply to a disposal of currency of any description." } ] },
            { "number": "53", "title": "Motor vehicles", "subsections": [ { "number": "1", "content": "A motor vehicle used solely for private or non-profit purposes shall not be an asset for the purposes of this Part." }, { "number": "2", "content": "The exemption under this section shall be limited to not more than two motor vehicles by an individual in any year of assessment." } ] },
            { "number": "54", "title": "Gifts", "subsections": [ { "number": "1", "content": "Where a person disposes by way of a gift, an asset acquired by him by way of a gift or any other form of gift, not being an acquisition on a devolution on death, the gains accruing from the disposal shall not be chargeable gains." }, { "number": "2", "content": "For the purpose of this section and section 36 (2) of this Act, an asset is acquired or disposed of by way of gift where no consideration is paid or received for the acquisition or disposal." } ] },
            { "number": "55", "title": "Assets held in trust for charities", "subsections": [ { "number": "1", "content": "Any property held in trust for –", "clauses": [ { "letter": "a", "content": "a religious or charitable institution of a public character," }, { "letter": "b", "content": "any statutory or registered friendly society," }, { "letter": "c", "content": "any co-operative society registered under the co-operative societies law of any State, or" }, { "letter": "d", "content": "any trade union registered under the Trade Unions Act, shall not be subject to the provisions of Chapter Two of this Act, provided that the gain is not derived from the disposal of an asset acquired in connection with any trade or business carried on by the institution, society or trade union, and the gain is applied solely for the purpose of the institution, society or trade union." } ] }, { "number": "2", "content": "Where such property ceases to be subject of such trust –", "clauses": [ { "letter": "a", "content": "the trustees shall be treated as if they had disposed of, and immediately re-acquired the property for a consideration equal to its market value, any gain on the disposal shall be treated as not accruing to the institution or society; and" }, { "letter": "b", "content": "any gain accruing directly or indirectly on that disposal shall be treated as having accrued to the trustees and shall be chargeable gains for the purposes of Chapter Two of this Act." } ] } ] }
          ]
        },
        {
          "title": "PART IX – RATES OF TAX",
          "sections": [
            { "number": "56", "title": "Rates of tax for companies", "content": "Tax shall be levied, for each year of assessment in respect of total profits of every company, in the case of –", "clauses": [ { "letter": "a", "content": "a small company, at 0%; and" }, { "letter": "b", "content": "any other company, at the rate of 30 per cent from the commencement of this Act." } ] },
            { "number": "57", "title": "Effective Tax Rate", "subsections": [ { "number": "1", "content": "Notwithstanding any provision of this Act or any other enactment, where, in any year of assessment, the effective tax rate of a company is less than 15%, such company shall recompute and pay an additional tax that makes its effective tax rate equal to 15%." }, { "number": "2", "content": "The provisions of this section shall apply to –", "clauses": [ { "letter": "a", "content": "a company that is a constituent entity of an MNE group; and" }, { "letter": "b", "content": "any other company with an aggregate turnover of 20,000,000,000 and above in the relevant year of assessment." } ] }, { "number": "4", "content": "For the purposes of this section – \"effective tax rate\" means the rate produced by dividing the aggregate covered tax paid by a company for a year of assessment by the profits of the company; and \"profits\" means the net profits before tax as reported in the audited financial statement less 5% of depreciation and personnel cost for the year." } ] },
            { "number": "58", "title": "Rates of tax for individuals", "content": "The income tax payable on the chargeable income of an individual, other than an individual earning the Minimum Wage in line with the Minimum Wage Act, in respect of each year of assessment, shall be as specified in the Fourth Schedule to this Act." }
          ]
        },
        {
          "title": "PART X – DEVELOPMENT LEVY",
          "sections": [
            { "number": "59", "title": "Development levy", "subsections": [ { "number": "1", "content": "A development levy of 4% is imposed on the assessable profits of all companies chargeable to tax under Chapters Two and Three of this Act, other than small companies and non-resident companies." }, { "number": "2", "content": "The Service shall collect the levy and pay it into a special account created for that purpose." }, { "number": "3", "content": "The revenue accruing from the levy shall be distributed as follows –", "clauses": [ { "letter": "a", "content": "Tertiary Education Trust Fund – 50%;" }, { "letter": "b", "content": "Nigerian Education Loan – 15%;" }, { "letter": "c", "content": "National Information Technology Development Fund – 8%;" }, { "letter": "d", "content": "National Agency for Science and Engineering Infrastructure – 8%;" }, { "letter": "e", "content": "National Board for Technological Incubation –4%;" }, { "letter": "f", "content": "Defence and Security Infrastructure Fund –10%; and" }, { "letter": "g", "content": "National Cybersecurity Fund – 5%." } ] }, { "number": "4", "content": "The tax imposed under this Part shall not be levied on assessable profits computed for the purposes of hydrocarbon tax." }, { "number": "5", "content": "For the purpose of this section, every beneficiary agency and Fund in subsection (3) shall be required to prepare and submit their income and expenditure to the National Assembly for appropriation." }, { "number": "6", "content": "The provisions of the Fourteenth Schedule shall apply for the purpose of further allocation of the distribution in subsection (3)(f)." } ] }
          ]
        },
        {
          "title": "PART XI – SPECIALISED TRADE OR BUSINESS",
          "sections": [
            { "number": "60", "title": "Export processing and free trade zone entities", "content": "Where a trade or business is carried on by an export processing or export free zone entity, the provisions of the Second Schedule to this Act shall apply." },
            { "number": "61", "title": "Insurance trade or business", "subsections": [ { "number": "1", "content": "An insurance business shall be taxed as a –", "clauses": [ { "letter": "a", "content": "general insurance company, whether proprietary or mutual, other than a life insurance company; or" }, { "letter": "b", "content": "life insurance company: Provided that the profits on which tax may be imposed for an insurance business shall be in accordance with section 6 or 17 of this Act." } ] }, { "number": "2", "content": "The profits on which tax may be imposed, in the case of –", "clauses": [ { "letter": "a", "content": "a general insurance, shall be ascertained in accordance with the provisions of subsection (3) as if the whole premium and investment incomes of the company were derived from Nigeria; and" }, { "letter": "b", "content": "a life insurance, shall be ascertained in accordance with the provisions of subsections (4) and (5) as if the whole investment and other incomes were received in Nigeria and all the expenses and other outgoings of the company were incurred in Nigeria." } ] }, { "number": "3", "content": "For a general insurance business, the profit on which tax may be imposed shall be ascertained by taking the gross premium and other income receivable, less reinsurance, and deducting from the balance so arrived at, a reserve for unexpired risks, determined in accordance with subsection (9)(a) and other deductions allowed under subsection (9)(b) and Chapter Two of this Act." }, { "number": "4", "content": "For a life insurance business, the profits on which tax may be imposed shall be the investment income, and other income, less the management expenses, including commission." }, { "number": "5", "content": "Any amount distributed in any form as dividend from an actuarial revaluation of unexpired risks or from any other revaluation shall be deemed to be part of the total profits of a company engaged in life insurance business." }, { "number": "6", "content": "The company shall provide the Service with full particulars of any revaluation carried out, including a copy of the actuary's revaluation certificate, not more than three months after an actuarial revaluation of unexpired risks or any other revaluation has taken place." }, { "number": "7", "content": "Where an insurance company carries on a life class and a general or non-life class insurance business, the funds and books of accounts of one class shall be kept separate from the other as though one class does not relate to the other class, and the annual tax returns of the two classes of insurance businesses shall be made separately." }, { "number": "8", "content": "Each class of insurance shall be assessed separately as life insurance assessment or non-life insurance assessment, and in respect of each class of insurance business, where there are more than one type of insurance in the same class, they form one type of business and the loss from one class shall not be allowed against the income from another class of insurance business, provided that the loss shall be available to be carried forward against the profits from the same class of insurance business." }, { "number": "9", "content": "An insurance company, other than a life insurance company, shall be allowed to deduct from its premium the following reserves for tax purposes –", "clauses": [ { "letter": "a", "content": "reserve for unexpired risks, calculated on a time apportionment basis of the risks accepted in the year ; and" }, { "letter": "b", "content": "for outstanding claims and outgoings, an amount equal to the total estimated amount of all outstanding claims and outgoings, provided that any amount not utilised towards settlement of claims and outgoings shall be added to the total profits of the following year." } ] }, { "number": "10", "content": "An insurance company, in respect of its life insurance business, shall be allowed to deduct the following from its investment income and other incomes –", "clauses": [ { "letter": "a", "content": "an amount which makes a general reserve and fund equal to the net liabilities on policies in force at the time of an actuarial valuation;" }, { "letter": "b", "content": "an amount which is equal to 1% of gross premium earned or 10% of net profits, whichever is greater, to a special reserve fund and accumulated until it becomes the amount of the statutory minimum paid-up capital; and" }, { "letter": "c", "content": "all allowable business outgoings." } ] }, { "number": "11", "content": "A reinsurance company shall be allowed to deduct the following from its gross profit, to be credited to a general reserve fund –", "clauses": [ { "letter": "a", "content": "an amount not more than 50% of the gross profits of the reinsurer for the year, where the general reserve fund is less than the statutory minimum paid-up capital; or" }, { "letter": "b", "content": "an amount not more than 25% of the gross profits of the reinsurer for the year, where the fund is equal to, or exceeds the statutory minimum paid-up capital." } ] }, { "number": "12", "content": "An insurance company that engages the services of an insurance agent, a loss adjuster or an insurance broker shall include in its annual tax returns, a schedule showing the name and address of that agent, loss adjuster or insurance broker, the date their services were employed and terminated, as applicable, and payments made to each such agent, loss adjuster or insurance broker for the period covered by the tax returns." }, { "number": "13", "content": "For the purposes of this section – \"gross premium\" means the total premiums written, received and receivable, excluding unearned premium and premiums returned to the insured; \"gross income\" means total income earned by a life insurance business including all investment income, fees, commission and income from other assets but excluding franked investment income, premiums received and claims paid by re-insurers; \"investment income\" for the purposes of taxation of a life insurance company under this section means income derived from investment of shareholders' funds; \"non-life insurance business\" means general or other insurance business, other than life insurance business; and \"other income\", for the purposes of non-life insurance businesses, means all the income of the non-life insurance business other than gross premium and franked investment income." } ] },
            { "number": "62", "title": "Lottery and gaming trade or business", "subsections": [ { "number": "1", "content": "Notwithstanding anything to the contrary in any other law, the income of lottery and gaming trade or business shall be charged to tax in accordance with the provisions of this Act." }, { "number": "2", "content": "In determining the assessable profits of lottery and gaming trade or business, the following deductions shall be allowed, in addition to other deductions allowed under Chapter Two of this Act –", "clauses": [ { "letter": "a", "content": "any amount paid as winnings, prizes or similar payments from the relevant Prize Fund;" }, { "letter": "b", "content": "agency commission expenses incurred; and" }, { "letter": "c", "content": "levies paid to relevant regulatory and government authorities as contained in relevant federal or state laws." } ] }, { "number": "3", "content": "For the purposes of this section – \"gaming\" includes gambling, wagering, video poker, roulette, craps, bingo, slot or gaming machine, drawings or other games of chance conducted by any person; and \"lottery\" or \"lotteries\" includes any betting, game, scheme, arrangement, system, plan, promotional competition or device for the distribution of prizes by lot or chance, or as a result of the exercise of skill and chance or based on the outcome of real or virtual sporting events, or any other game, scheme, arrangement, system, plan, competition or device." } ] },
            { "number": "63", "title": "Collective investment scheme", "subsections": [ { "number": "1", "content": "Where under the provisions of the Investments and Securities Act, a mutual fund is established for the purpose of providing facilities for the participation of the public, as beneficiaries under a trust, in profits or income arising from acquisition, holding, management or disposal of securities or any other property, chapter two of this Act shall, in respect of the income arising to the trustees of a collective investment, have effect as if the –", "clauses": [ { "letter": "a", "content": "trustees were a company whose business consists mainly in the making of investments and the principal part of whose income is derived from it;" }, { "letter": "b", "content": "rights of the unit holders were shares in the company; and" }, { "letter": "c", "content": "income accruing to the trustees as is available for payment to the unit holders were dividends on such shar es, and reference to a company in this Act shall include a collective investment scheme." } ] }, { "number": "2", "content": "For the purpose of section 27 of this Act, the profits of an authorised collective investment scheme, on which tax, may be imposed, shall be ascertained by taking the income accruing to the trustees from all the investments of the scheme and deducting there from sums disbursed as management expenses, including remuneration for the managers." }, { "number": "3", "content": "Where the trustees of a scheme receive a payment on which the scheme suffers tax by deduction, not being franked investment income, the tax deducted shall constitute an advance payment of income tax and shall be set-off against income tax assessment for that year of assessment in ascertaining the tax payable by the mutual fund or scheme." }, { "number": "4", "content": "The profit accruing to the trustees of a collective investment that is available for payment to unit holders or for investment shall be deemed to be dividends paid or payable by the trustees to the unit holders in proportion to their rights, and shall be taxed in the hands of the unit holders." }, { "number": "5", "content": "In this section – \"authorised collective investment\" means a scheme that is authorised by the Securities and Exchange Commission under the Investment and Securities Act to carry on the business of dealing in a mutual fund scheme or collective investment scheme; \"collective investment scheme\" means any arrangement made for the purpose of providing facilities for the participation of the public as beneficiaries under a trust in profits or income arising from the acquisition, holding, management or disposal of securities or any other property; \"scheme\" means authorised collective investment; \"trustee\" under a collective investment scheme means the person in whom the property for the time being subject to any trust created under the scheme is or may be invested in accordance with the terms of the trust; and \"unit holder\" means any investor, beneficiary or person who acquired units in a scheme and who is entitled to a share of the investments subject to the trusts of a scheme." } ] },
            { "number": "64", "title": "Mining operations", "subsections": [ { "number": "1", "content": "Trade or business engaged in mining operations is subject to tax under the relevant provisions of Chapter Two of this Act." }, { "number": "2", "content": "For the purposes of computing the assessable profits of a company engaged in mining operations, any amount contributed to any fund, scheme or arrangement approved by the relevant authority for the purposes of providing for environmental protection, environmental remediation, mine rehabilitation, land reclamation and mine closure shall be tax deductible: Provided that the amount so contributed is cash-backed and invested in a dedicated account or trust fund managed by independent trustees or funds." }, { "number": "3", "content": "Royalty is imposed on any mineral obtained in the course of exploration or mining operations at a rate prescribed under the Eighth Schedule to this Act, subject to the relevant provisions of Nigeria Tax Administration Act, 2025, and the royalty paid shall be tax deductible in determining the assessable profits from the trade or business." }, { "number": "4", "content": "The Service shall be the relevant tax authority for the administration of the royalty imposed under this section." } ] }
          ]
        }
      ]
    },
    {
      "title": "CHAPTER 3 – TAXATION OF INCOME FROM PETROLEUM OPERATIONS",
      "parts": [
        {
          "title": "PART I – HYDROCARBON TAX, ASCERTAINMENT OF CHARGEABLE TAX, ASCERTAINMENT OF CHARGEABLE PROFITS AND CONSOLIDATION FOR TAX PURPOSES",
          "sections": [
            { "number": "65", "title": "Application of this Part", "subsections": [ { "number": "1", "content": "This Part shall apply to companies engaged in upstream petroleum operations in the onshore, shallow water and deep offshore with licences and leases under the Petroleum Industry Act." }, { "number": "2", "content": "In this Part –", "clauses": [ { "letter": "a", "content": "hydrocarbon tax shall apply to crude oil as well as field condensates and liquid natural gas liquids derived from associated gas and produced in the field upstream of the measurement points; and" }, { "letter": "b", "content": "hydrocarbon tax shall not apply to –", "items": [ { "number": "i", "content": "associated natural gas, including gaseous natural gas liquids produced in the field and contained in the rich gas, and non-associated natural gas," }, { "number": "ii", "content": "condensates and natural gas liquids produced from non-associated gas in fields or gas processing plants, provided the related volumes are determined at the measurement points or at the exit of the gas processing plant, regardless of whether the condensates or natural gas liquids are subsequently commingled with crude oil, and" }, { "number": "iii", "content": "any condensates and natural gas liquids produced from associated gas at gas processing or other facilities downstream of the measurement points." } ] } ] }, { "number": "3", "content": "The costs of production of associated gas, upstream of the measurement point shall be allocated to crude oil for the purposes of calculating hydrocarbon tax, provided that capital and operating costs for wells solely producing associated gas-cap gas shall not be allocated to crude oil, but shall be claimed under Chapter Two of this Act." }, { "number": "4", "content": "This Part shall not apply to a frontier acreage until it is reclassified under section 68 (3) of the Petroleum Industry Act." }, { "number": "5", "content": "For the purposes of determining royalties, condensates shall be treated as crude oil and natural gas liquids as natural gas." }, { "number": "6", "content": "Upstream petroleum operations shall in addition to hydrocarbon tax, be subject to Chapter Two of this Act." } ] },
            { "number": "66", "title": "Charge of hydrocarbon tax", "content": "Subject to the provisions of section 65(2) of this Act, there is levied upon the profits of any company engaged in upstream petroleum operations in relation to crude oil, a tax to be known as hydrocarbon tax, which shall be charged and assessed on its profits related to the operations for each accounting period and payable in accordance with this Part." },
            { "number": "67", "title": "Ascertainment of crude oil revenue, adjusted profit, assessable profits", "subsections": [ { "number": "1", "content": "Subject to this Part and the relevant provisions of the Petroleum Industry Act, in relation to any accounting period, the crude oil revenue of a company for that period shall be the value of any chargeable oil adjusted to the measurement points, based on the –", "clauses": [ { "letter": "a", "content": "proceeds of all chargeable oil sold by the company; and" }, { "letter": "b", "content": "value of all chargeable oil disposed by the company." } ] }, { "number": "2", "content": "For the purposes of subsection (1), the value of any chargeable oil disposed, shall be regarded as the aggregate of the value of that crude oil determined for royalties for all fields in accordance with this Act, relevant provisions of the Petroleum Industry Act or any other applicable law." }, { "number": "3", "content": "Subject to section 71(2) of this Act, the adjusted profits of an accounting period shall be the profits of that period after the deductions and additions under section 68 of this Act." }, { "number": "4", "content": "The assessable profit of an accounting period shall be the adjusted profit of that period after any deduction allowed by section 70 of this Act." }, { "number": "5", "content": "The chargeable profits of an accounting period shall be the assessable profits of that period after the deduction allowed by section 71 of this Act." } ] },
            { "number": "68", "title": "Allowable deductions", "subsections": [ { "number": "1", "content": "In computing the adjusted profit of a company engaged in upstream petroleum operations related to crude oil for any accounting period, there shall be deducted expenses wholly and exclusively incurred during that period for the following –", "clauses": [ { "letter": "a", "content": "rents incurred by the company for the period pursuant to a petroleum mining lease or petroleum prospecting licence;" }, { "letter": "b", "content": "all royalties incurred by the company during that period in respect of crude oil and associated gas and where payments to the Federation Account from a petroleum mining lease is related to production sharing, profit sharing, risk service contracts or other contractual features under a model contract and the company has incurred liability for such payments;" }, { "letter": "c", "content": "expenses directly incurred for repair of plant, machinery or fixtures employed for the purpose of carrying on production activities or for the renewal, repair or alteration of production implement, utensils or articles so employed;" }, { "letter": "d", "content": "an expenditure, tangible or intangible directly incurred in connection with the drilling of the first exploration well and the first two appraisal wells in the same field, whether the wells are productive or not, provided that subsequent exploration wells, appraisal wells and other wells shall be treated as qualifying drilling expenditure under Part II of the First Schedule to this Act and where a deduction may be given under this section in respect of any such expenditure, that expenditure shall not be treated as qualifying drilling expenditure for the purpose of Part II of First Schedule to this Act ;" }, { "letter": "e", "content": "any amount contributed to a fund, scheme or arrangement relating to abandonment plan approved by the Commission for the purpose of decommissioning and abandonment, provided that the surplus or residue of the fund shall be subject to tax under this Part at the end of life of the field, where such surplus is returned to the lessee ;" }, { "letter": "f", "content": "all sums incurred by the company to the Federal Government or any State or Local Government Council by way of levies, stamp duties and fees;" }, { "letter": "g", "content": "costs of gas reinjection wells, which are re-injecting natural gas that otherwise would be flared, subject to ratification by the Commission; and" }, { "letter": "h", "content": "any amount contributed to any fund, scheme or arrangement approved by the Commission pursuant to the establishment of host communities' development trusts under Chapter 3 of the Petroleum Industry Act, Environmental Remediation Fund, Niger Delta Development Commission and other similar contributions." } ] }, { "number": "2", "content": "Liability waived, released or recovered shall be treated under this Part in accordance with section 193 of this Act." } ] },
            { "number": "69", "title": "Deductions not allowed", "content": "Subject to this Part, for the purpose of ascertaining the adjusted profit of a company in the accounting period from its upstream petroleum operations applicable to crude oil, no deduction shall be allowed in respect of –", "clauses": [ { "letter": "a", "content": "expenditure for the purchase of information relating to the existence and extent of petroleum deposits, other than for the acquisition of geophysical, geological and geochemical data and information;" }, { "letter": "b", "content": "expenditure incurred as a penalty, natural gas flare fees or imposition relating to natural gas flare;" }, { "letter": "c", "content": "financial or bank charges, arbitration and litigation costs, bad debts and interest on borrowing;" }, { "letter": "d", "content": "head office or affiliate costs, shared costs, research and development costs or any other like shared indirect production costs;" }, { "letter": "e", "content": "production bonuses, signature bonuses paid for the acquisition of, or of rights in or over, petroleum deposits, bonuses or fees paid for renewing petroleum mining lease or petroleum prospecting licence or marginal field or fees paid for assigning rights to another party;" }, { "letter": "f", "content": "tax inputted into a contract or an agreement on a net of tax basis and paid by a company on behalf of the vendor or contractor;" }, { "letter": "g", "content": "capital withdrawn or sum employed or intended to be employed as capital;" }, { "letter": "h", "content": "capital employed in improvements as distinct from repairs;" }, { "letter": "i", "content": "sum recoverable under an insurance or contract of indemnity, except an amount that is not recovered under the scheme;" }, { "letter": "j", "content": "rent of or cost of repairs to any premises or part of premises not incurred for the purpose of those operations;" }, { "letter": "k", "content": "amounts incurred in respect of any income tax, special tax, development levy, profits tax or other similar taxes, whether charged within Nigeria or elsewhere;" }, { "letter": "l", "content": "the depreciation of any premises, buildings, structures, works of a permanent nature, plant, equipment, machinery, furniture or fixtures;" }, { "letter": "m", "content": "payment to provident, savings, widows and orphans or other society, scheme or fund;" }, { "letter": "n", "content": "any contribution to a pension, provident or other society, scheme or fund for production staff which may be approved, with or without retrospective effect, by the National Pension Commission subject to such general conditions or particular conditions, in the case of the society, scheme or fund as the Service may prescribe, provided that any sum received by or the value of any benefit obtained by the company from any approved pension, provident or other society, scheme or fund, in the accounting period of that company shall, for the purpose of section 68 (2) of this Act, be treated as income of the company for that accounting period;" }, { "letter": "o", "content": "all customs duties;" }, { "letter": "p", "content": "any expense on which Value Added Tax is due under this Act but not charged, or in the case of imported items, any expense on which the applicable import duty or levy was not paid; and" }, { "letter": "q", "content": "costs under paragraph 2(2)(c) of the Sixth Schedule to this Act." } ] },
            { "number": "70", "title": "Assessable profits and losses", "subsections": [ { "number": "1", "content": "The assessable profits for each company or petroleum mining lease for any accounting period shall be the amount of the adjusted profit of that period after the deduction of the amount of any loss incurred by that company during any previous accounting period." }, { "number": "2", "content": "The assessable profit shall be determined separately for each of the two classes of chargeable tax identified in section 72 (a) and (b) of this Act." }, { "number": "3", "content": "The loss referred to in subsection (1) shall be deducted to the extent possible from the amount of the adjusted profits of the accounting period immediately succeeding the accounting period in which the loss was incurred, and in subsequent accounting periods, until the loss is fully recouped." }, { "number": "4", "content": "Within five months after the end of any accounting period of a company, or within such further time as the Service may permit in writing, the company may elect in writing that a deduction or any part to be made under this section shall be deferred to and be made in the succeeding accounting period, and may so elect in any succeeding accounting period." } ] },
            { "number": "71", "title": "Chargeable profits and allowances", "subsections": [ { "number": "1", "content": "The chargeable profits of a company for any accounting period shall be the amount of the assessable profits of that period after the deduction of any amount to be allowed in accordance with the provisions of this section as follows –", "clauses": [ { "letter": "a", "content": "the aggregate amount of capital allowances due to the company under the provisions of Part II of First Schedule to this Act for the accounting period;" }, { "letter": "b", "content": "the aggregate amount of all production allowances due to the company under the provisions of the Sixth Schedule to this Act for the accounting period; and" }, { "letter": "c", "content": "in the case of acquisition costs of petroleum rights, the value of the rights and the value of the assets acquired shall be reported separately to the Service, provided that the value of the rights shall be eligible for annual allowance of 20% per annum until it is fully written off and the value of the assets shall be depreciated based on the applicable depreciation rates for the respective assets under Part II of the First Schedule to this Act." } ] }, { "number": "2", "content": "In determining the chargeable profit, the total cost shall not exceed the cost-price ratio as determined in the Sixth Schedule to this Act." }, { "number": "3", "content": "The chargeable profits and allowances shall be determined separately for the two classes of assessable profits under section 72 (a) and (b) of this Act." }, { "number": "4", "content": "Where Value Added Tax is due under this Act but not charged on an asset, or in the case of an imported item, the applicable import duty or levy was not paid, the relevant expenditure shall not be eligible as a qualifying capital expenditure under the provisions of Part II of First Schedule to this Act." } ] },
            { "number": "72", "title": "Chargeable hydrocarbon tax", "content": "The chargeable hydrocarbon tax for any accounting period of a company shall be a percentage of the aggregated chargeable profit for that period and it shall be –", "clauses": [ { "letter": "a", "content": "30% of the profit from crude oil for petroleum mining leases selected under section 93 (6) (b) and (7) (b) of the Petroleum Industry Act with respect to onshore and shallow water areas; and" }, { "letter": "b", "content": "15% of profit from crude oil for onshore and shallow water and for petroleum prospecting licences selected under section 93 (6) (a) and (7) (a) of Petroleum Industry Act." } ] },
            { "number": "73", "title": "Additional chargeable tax payable in certain circumstances", "subsections": [ { "number": "1", "content": "Where, for any accounting period of a company, there is a sale of chargeable oil between connected persons, or disposal of chargeable oil between connected or unconnected persons, and the amount of the chargeable hydrocarbon tax for that period, calculated in accordance with the provisions of this Part other than this section, is less than the amount prescribed in subsection (2), the company shall pay an additional amount of chargeable hydrocarbon tax for that period equal to the difference between those two amounts." }, { "number": "2", "content": "The amount referred to in subsection (1) is, for any accounting period of a company, the amount which the chargeable hydrocarbon tax for crude oil for that period, calculated in accordance with this Part, shall be, if the reference in section 67 (1) (a) of this Act to the proceeds of sale were a reference to the amount obtained by multiplying the number of barrels of that crude oil determined at the measurement point by the fiscal oil price per barrel." }, { "number": "3", "content": "For the purpose of subsection (2), the Commission shall establish the fiscal oil price at each measurement point on an export parity basis under paragraph 8 (1) and (2) of the Seventh Schedule of the Petroleum Industry Act and the total value of the chargeable oil for a company shall be the sum of the multiplications of volume and fiscal oil price at all measurement points as established by the Commission." }, { "number": "4", "content": "The whole of any additional chargeable hydrocarbon tax for crude oil and associated gas payable by a company under this section for any accounting period shall be paid concurrently with the final instalment of the chargeable hydrocarbon tax payable for that period." }, { "number": "5", "content": "Where there is no fiscal oil price established for a crude oil stream, the Commission shall establish fiscal oil price for such stream and the fiscal oil price per barrel established shall bear a fair and reasonable relationship –", "clauses": [ { "letter": "a", "content": "to the established fiscal oil price of Nigerian crude oil streams of comparable quality and specific gravity; or" }, { "letter": "b", "content": "where there are no such Nigerian crude oil streams of comparable quality and specific gravity, it shall bear a fair and reasonable relationship to the official selling prices at main international trading centres for crude oil of comparable quality and gravity, due regard being had in either case to freight differentials and other relevant factors." } ] }, { "number": "6", "content": "Notwithstanding any other provision in this Part, where crude oil, which in relation to a particular company is its chargeable oil, is sold or disposed by another company, the crude oil shall for the purpose of this section be deemed to be sold or disposed by that particular company." } ] },
            { "number": "74", "title": "Pre-production cost", "content": "Where a company has not commenced the production and sale or disposal of chargeable oil, all costs incurred wholly and exclusively for the purpose of coming into upstream petroleum operations, subject to sections 68 and 69 of this Act, shall upon commencement of production and sale or disposal of chargeable oil be deemed to have incurred a qualifying pre-production capital expenditure which shall be amortised in line with paragraphs 2 and 14 of Part II of First Schedule to this Act." },
            { "number": "75", "title": "Trade or business sold or transferred", "content": "The sale or transfer of a trade or business of upstream petroleum operations carried on in Nigeria by a company to another company shall be treated in accordance with section 190 of this Act." },
            { "number": "76", "title": "Consolidation of costs and revenue", "subsections": [ { "number": "1", "content": "A company engaged in upstream petroleum operations across terrains shall be allowed to consolidate costs and incomes for the purpose of income tax under Chapter Two of this Act." }, { "number": "2", "content": "A company engaged in upstream petroleum operations related to crude oil across terrains shall be allowed to consolidate costs and revenue for the purposes of hydrocarbon tax, only across assets in which it holds licences and leases in accordance with the two categories of chargeable tax stipulated in section 72 of this Act." } ] },
            { "number": "77", "title": "Partnerships", "subsections": [ { "number": "1", "content": "A person, other than a company, who engages in upstream petroleum operations either on his own account or jointly with any other person or in partnership with any other person with a view to sharing the profits arising from the operations, commits an offence." }, { "number": "2", "content": "Where the person referred to in subsection (1) has benefitted from any profits on upstream petroleum operations, the person shall be subject to hydrocarbon tax and income tax under section 78 of this Act on the profits and shall pay a penalty provided under the Nigeria Tax Administration Act, 2025." }, { "number": "3", "content": "Where two or more companies are engaged in upstream petroleum operations either in partnership, in a joint venture or in concert under any scheme or arrangement, tax shall be charged and assessed on them in accordance with subsection (4)." }, { "number": "4", "content": "The apportionment of any profits, outgoings, expenses, liabilities, deductions, qualifying expenditure and the tax chargeable upon each company shall be in line with the equity interest of the parties under a jointly executed agreement that will be made available to the Service and where no jointly executed agreement is made available, the Commission shall advise the Service of the approved equity interest of the parties and it shall be binding on the parties." }, { "number": "5", "content": "Subject to this Part, where two or more companies are engaged in upstream petroleum operations either in partnership, in a joint venture or in concert under any scheme or arrangement, the Service may make regulations, for the ascertainment of tax to be charged or assessed upon each company so engaged." }, { "number": "6", "content": "Regulations made under subsection (5) may make provisions –", "clauses": [ { "letter": "a", "content": "with respect to apportionment of any profits, outgoings, expenses, liabilities, deductions, qualifying expenditure and tax chargeable upon each company ;" }, { "letter": "b", "content": "for the computation of any tax as if the partnership, joint venture, scheme or arrangement were carried on by one company and apportion the tax between the companies concerned ;" }, { "letter": "c", "content": "to accept other basis of ascertaining the tax chargeable upon each of the companies; or" }, { "letter": "d", "content": "which have regard to any circumstances whereby the operations are partly carried on for any company by an operating company whose expenses are reimbursed by those companies." } ] }, { "number": "7", "content": "Regulations made under this section may be of general application for the purpose of this section and this Part or for a class of arrangement or for a particular application to a specific partnership, joint venture, scheme or arrangement." }, { "number": "8", "content": "The effect of regulations made under this section shall not impose a greater burden of tax upon any company so engaged in any partnership, joint venture, scheme or arrangement than would have been imposed upon that company under this Part, if all things enjoyed, done or suffered by such partnership, joint venture, scheme or arrangement had been enjoyed, done or suffered by that company in the proportion in which it enjoys, does or suffers those things under or by virtue of that partnership, joint venture, scheme or arrangement." } ] },
            { "number": "78", "title": "Income tax on petroleum operations", "subsections": [ { "number": "1", "content": "Sections 78 to 88 of this Act and the provisions of chapter two of this Act shall apply to any company, concessionaire, licensee, lessee, contractor or subcontractor involved in the upstream, midstream or downstream petroleum operations under the Petroleum Industry Act –" }, { "number": "2", "content": "For the purpose of determining the value of chargeable crude oil or chargeable gas, in relation to any accounting period, the crude oil and gas revenue of a company for that period shall be the value of any chargeable oil or chargeable gas adjusted to the measurement points, based on the –", "clauses": [ { "letter": "a", "content": "proceeds of all chargeable oil or gas sold by the company; and" }, { "letter": "b", "content": "value of all chargeable oil or gas disposed by the company." } ] }, { "number": "3", "content": "In determining the income tax under Chapter Two of this Act –", "clauses": [ { "letter": "a", "content": "hydrocarbon tax is not deductible; and" }, { "letter": "b", "content": "income chargeable to tax includes –", "items": [ { "number": "i", "content": "all income of that period incidental to and arising from any one or more of its petroleum operations, and" }, { "number": "ii", "content": "gains arising from the disposal of assets accruing to the company in any accounting period, ascertained in accordance with the relevant provisions of Part VIII of Chapter two of this Act." } ] } ] } ] },
            { "number": "79", "title": "Registration and use of separate company for each stream of petroleum operations", "subsections": [ { "number": "1", "content": "Subject to sections 142 (2) and 197(2) of the Petroleum Industry Act, a person intending to be involved in more than one stream, that is, upstream, midstream or downstream petroleum operations, shall register and use a separate company for each stream of petroleum operations under the Petroleum Industry Act: Provided that, for companies with petroleum mining leases selected under section 93 (6) (b) and (7) (b) of the Petroleum Industry Act, no stamp duties, value added tax or income tax on chargeable gains shall be levied by the Government on such segregation." }, { "number": "2", "content": "For strategic projects in the upstream petroleum operations that seek to produce oil and natural gas to be processed or refined to finished petroleum products, and supplied in wholesale solely to the domestic market, such projects shall have the option to be established as an integrated strategic project (ISP), whereby the capital investment in the associated midstream petroleum operations as defined under the Petroleum Industry Act, can be consolidated with the upstream petroleum operations for purposes of tax." }, { "number": "3", "content": "Where an ISP option is elected, the following provisions shall apply –", "clauses": [ { "letter": "a", "content": "arm's length transfer prices shall be established to fiscalise the hydrocarbons transferred from the upstream petroleum operations to the midstream petroleum operations; and" }, { "letter": "b", "content": "capital investment in the midstream petroleum operations consolidated with upstream petroleum operations shall not be represented for capital allowance when fiscalising the income from midstream petroleum operations." } ] } ] },
            { "number": "80", "title": "Provisions relating to gas", "subsections": [ { "number": "1", "content": "In addition to the economic development tax incentive that may be granted under Part II of Chapter Eight of this Act, investors in gas pipeline shall be granted a tax-free period of five years at the expiration of the economic development incentive certificate." }, { "number": "2", "content": "Natural gas transferred or disposed from the upstream to the midstream or downstream shall be subject to tax under the relevant provisions of Chapter Two of this Act." }, { "number": "3", "content": "Natural gas liquids and liquid petroleum gases derived from natural gas shall be subject to income tax under the relevant provisions of Chapter Two of this Act." } ] },
            { "number": "81", "title": "Allowances for the purposes of income tax on petroleum operations", "subsections": [ { "number": "1", "content": "Acquisition costs of petroleum rights shall be eligible for annual allowance at the rate of 20% until the cost is fully written off." }, { "number": "2", "content": "Capital allowance for other assets shall be granted as follows –", "clauses": [ { "letter": "a", "content": "upstream petroleum operations assets shall be in accordance with Part II of the First Schedule to this Act; and" }, { "letter": "b", "content": "midstream and downstream operations shall be in accordance with Part I of the First Schedule to this Act." } ] } ] },
            { "number": "82", "title": "Expense deductibility", "subsections": [ { "number": "1", "content": "For the purpose of determining income tax, section 20 of this Act shall be read in conjunction with the provisions of this subsection as regards the followings –", "clauses": [ { "letter": "a", "content": "all rents and royalties the liability for which was incurred by the company during that period in respect of crude oil sold, condensate sold and natural gas sold or delivered or disposed of in any other commercial manner and where a petroleum mining lease includes payments to the Federation Account related to production sharing, profit sharing, risk service contracts or other contractual features and the company has incurred liability for such payments and such payments were made;" }, { "letter": "b", "content": "any amount contributed to any fund, scheme or arrangement approved by the Commission or Authority for the purpose of providing for –", "items": [ { "number": "i", "content": "abandonment and decommissioning," }, { "number": "ii", "content": "petroleum host communities development trust, or" }, { "number": "iii", "content": "environmental remediation; and" } ] }, { "letter": "c", "content": "any other deduction as may be prescribed by the Minister by order published in the Official Gazette." } ] }, { "number": "2", "content": "For the purpose of determining income tax, section 21 of this Act shall be read in conjunction with the provisions of this subsection as regards the followings –", "clauses": [ { "letter": "a", "content": "any expenditure for the purchase of information relating to the existence and extent of petroleum deposits, other than for the acquisition of geological, geophysical and geochemical data or information;" }, { "letter": "b", "content": "any expenditure incurred as a penalty including natural gas flare fees or any such imposition relating to natural gas flare;" }, { "letter": "c", "content": "production bonuses, signature bonuses paid for the acquisition of, or of rights in or over, petroleum deposits, signature bonuses or fees paid for renewing petroleum mining lease or petroleum prospecting licence or fees paid for assigning rights to another party including for marginal fields; and" }, { "letter": "d", "content": "any tax inputted into a contract or an agreement on a net of tax basis and paid by a company on behalf of the vendor or contractor." } ] } ] },
            { "number": "83", "title": "Basis period for income tax on petroleum operations", "content": "Any company involved in upstream petroleum operations shall apply the accounting periods established for hydrocarbon tax on an actual year basis for its income tax." },
            { "number": "84", "title": "Additional income tax payable in certain circumstances", "subsections": [ { "number": "1", "content": "Where, for any accounting period of a company, there is a sale of chargeable oil or chargeable gas between connected persons, or disposal of chargeable oil or chargeable gas between connected or unconnected persons, and the amount of the income tax chargeable for that period, calculated in accordance with the provisions of sections 78 to 83, and Chapter Two of this Act, is less than the amount prescribed in subsection (2), the company shall be liable to pay an additional amount of chargeable tax for that period equal to the difference between those two amounts." }, { "number": "2", "content": "The amount referred to in subsection (1) is, for any accounting period of a company, the amount which the chargeable tax for crude oil or gas for that period, calculated in accordance with this section and chapter two of this Act shall be, if the reference in section 78 (2)(a) and (b) of this Act, to the proceeds of sale or disposal were a reference to the amount obtained by multiplying the number of barrels of that crude oil or gas determined at the measurement point by the fiscal oil price per barrel or fiscal gas price per MMBtu." }, { "number": "3", "content": "For the purposes of subsection (2), the relevant sum per barrel of crude oil, condensate or gas per MMBtu by a company is the fiscal oil price or fiscal gas price applicable to that crude oil or gas as may be established by the Commission." }, { "number": "4", "content": "The whole of any additional chargeable tax for crude oil or chargeable gas payable by a company under this section for any accounting period shall be paid concurrently with the final instalment of the chargeable tax payable for that period." }, { "number": "5", "content": "Where there is no fiscal oil price or fiscal gas price established for a crude oil stream or gas, the Commission shall establish fiscal oil price or fiscal gas price for such stream and the fiscal oil or gas price established shall bear a fair and reasonable relationship -", "clauses": [ { "letter": "a", "content": "to the established fiscal oil or gas price of Nigerian crude oil streams or gas of comparable quality and specific gravity; or" }, { "letter": "b", "content": "where there are no such Nigerian crude oil streams or gas of comparable quality and specific gravity, it shall bear a fair and reasonable relationship to the official selling prices at main international trading centres for crude oil or gas of comparable quality and gravity, due regard being had in either case to freight differentials and other relevant factors." } ] }, { "number": "6", "content": "Notwithstanding any other provision in this Part, where crude oil or gas, which in relation to a particular company is its chargeable oil or gas, is sold or disposed by another company, the crude oil or gas shall for the purpose of this section be deemed to be sold or disposed by that particular company." } ] },
            { "number": "85", "title": "Non-Associated gas greenfield developments in onshore and shallow water terrains", "subsections": [ { "number": "1", "content": "Notwithstanding the provisions of this Act or any other law, the provisions of this section shall apply to all Non-Associated Gas greenfield developments in onshore and shallow water terrains reaching first commercial gas production from the commencement of this Act to 1 January, 2029 –", "clauses": [ { "letter": "a", "content": "where the hydrocarbon liquids do not exceed 30 barrels per million standard cubic feet, there shall be granted a gas production tax credit at the rate of US$1.00 per thousand cubic feet or 30% of the fiscal gas price, whichever is lower;" }, { "letter": "b", "content": "where the hydrocarbon liquids exceed 30 barrels per million standard cubic feet but do not exceed 100 barrels per million standard cubic feet, there shall be granted a gas production tax credit at the rate of US$0.50 per thousand cubic feet or 30% of the fiscal gas price, whichever is lower;" }, { "letter": "c", "content": "where the hydrocarbon liquids exceed 100 barrels per million standard cubic feet, the incentives under subsections (a) and (b) shall no longer apply;" }, { "letter": "d", "content": "the gas tax credit granted by this section shall apply on Non-Associated Gas sales for 10 years only, beginning from the date of attaining first gas production; and" }, { "letter": "e", "content": "at the expiration of the 10 years referred to in subsection (1)(d), gas production allowance shall be granted at the respective rates set out in subsection (1)(a) and (b), provided that gas production tax credit and gas production allowance shall not be granted in respect of gas production of the same period." } ] }, { "number": "2", "content": "In the case of all other Non-Associated Gas Greenfield projects with first commercial gas production after 1 January, 2029, gas production allowance shall be granted at US$0.50 per thousand cubic feet or 30% of the fiscal gas price, whichever is lower, provided that the hydrocarbon liquids do not exceed 100 barrels per million standard cubic feet." }, { "number": "3", "content": "The gas production tax credit that can be recouped in any year shall not exceed the tax payable on the field(s) for that year on that income, subject to the payment of any minimum tax where applicable." }, { "number": "4", "content": "Unrecouped tax credit in one year may be carried forward for a maximum of three years." }, { "number": "5", "content": "The fiscal gas price for calculating gas production tax credit and gas production allowance shall be the same price used for determining royalties." }, { "number": "6", "content": "The provisions of this section shall apply to oil mining leases and petroleum mining leases." }, { "number": "7", "content": "Where first gas production cannot be achieved due to force majeure, such as natural disasters or acts of terrorism, the timelines and obligations stipulated in subsection (1) may be suspended, subject to approval by the Commission, until such time as the force majeure ceases to exist." }, { "number": "8", "content": "The Commission shall certify the applicable hydrocarbon liquid ratios for the purposes of ascertaining appropriate gas production tax credit or gas production tax allowance." }, { "number": "9", "content": "The incentives under this section shall not apply to any company that has claimed Associated Gas Framework Agreement incentives for the same Non-Associated Gas Greenfield project." } ] },
            { "number": "86", "title": "Provision Relating to Decommissioning and Abandonment of Funds", "content": "Notwithstanding section 233(1) of the Petroleum Industry Act, a provision made for decommissioning and abandonment fund shall not be deductible for tax purposes, except –", "clauses": [ { "letter": "a", "content": "the licensee or lessee deposit a minimum of 30% of the decommissioning and abandonment fund with a Nigerian Bank, in the form of an escrow account accessible by the Commission or Authority; and" }, { "letter": "b", "content": "the Nigerian bank is accredited in accordance with the criteria for accreditation for participation in the management of the fund, determined by the Central Bank of Nigeria in collaboration with the Service." } ] },
            { "number": "87", "title": "General application of this Part and other matters", "subsections": [ { "number": "1", "content": "This Part and the provisions of the Petroleum Industry Act shall not apply to holders of an oil prospecting licence or oil mining lease who do not enter into a conversion contract until the termination or expiration of the respective oil prospecting licence or oil mining lease." }, { "number": "2", "content": "Notwithstanding subsection (1), the provisions of Chapter Two of this Act and paragraph 6 of the First Schedule to the Petroleum Industry Act shall apply to licences and leases awarded to indigenous Nigerian companies on a sole risk basis under the Petroleum Act, on which the Government has successfully exercised its back-in rights prior to the effective date of the Petroleum Industry Act, but any renewal of an oil mining lease shall be based on the provisions of this Part and the Petroleum Industry Act." }, { "number": "3", "content": "The fiscal provisions of this Part are the base terms that are applicable, and the Commission may under section 74(2) of Petroleum Industry Act conduct a licensing round whereby the bid parameter is a higher royalty, profit oil share or other fiscal features in order to ensure that the Government receives the full market value for each block." } ] },
            { "number": "88", "title": "Fiscal stabilisation", "subsections": [ { "number": "1", "content": "Fiscal stabilisation sections contained in a production sharing contract or other contracts entered into after the commencement of the Petroleum Industry Act shall not be applicable to the fiscal provisions listed in this Part, regardless of whether the changes in fiscal provisions affect the contractor favourably or unfavourably, provided such changes in fiscal provision are being made in a manner that is not discriminatory to the petroleum industry or the contractor." }, { "number": "2", "content": "The respective fiscal provisions referred to in subsection (1) are –", "clauses": [ { "letter": "a", "content": "generally applicable taxes, such as income tax, development levy, value added tax, stamp duties, and deduction of tax at source;" }, { "letter": "b", "content": "levies, taxes or payments to comply with modern principles in respect of environment, labour laws, health and safety; and" }, { "letter": "c", "content": "new taxes, levies or duties as may be prescribed by the Climate Change Act, or to implement Nigeria's commitments with respect to climate change under any international agreement." } ] } ] },
            { "number": "89", "title": "Petroleum royalty", "subsections": [ { "number": "1", "content": "All production of petroleum, including production tests shall be subject to royalties as provided in the Seventh Schedule to this Act." }, { "number": "2", "content": "The Service shall be the relevant tax authority for the administration of the royalty imposed under this Part, and the Seventh Schedule to this Act." } ] }
          ]
        },
        {
          "title": "PART II - PETROLEUM PROFITS TAX IMPOSITION OF TAX AND ASCERTAINMENT OF CHARGEABLE PROFITS, ASCERTAINMENT OF ASSESSABLE TAX AND OF CHARGEABLE TAX",
          "sections": [
            { "number": "90", "title": "Charge of petroleum profits tax", "subsections": [ { "number": "1", "content": "This Part shall apply to oil prospecting licences and oil mining leases that are yet to convert under the provisions of the Petroleum Industry Act." }, { "number": "2", "content": "Subject to Part I of Chapter Three of this Act and subsection (1), there is levied upon the profits of each accounting period of a company engaged in petroleum operations during that period a tax to be charged, assessed and payable in accordance with the provisions of this Part." } ] },
            { "number": "91", "title": "Ascertainment of profits, adjusted profit, assessable profits and chargeable profits", "subsections": [ { "number": "1", "content": "Subject to the provisions of this Part, the revenue of a company in an accounting period shall be the aggregate of –", "clauses": [ { "letter": "a", "content": "the proceeds of sale of all chargeable oil sold by the company in that period;" }, { "letter": "b", "content": "the value of all chargeable oil disposed by the company in that period;" }, { "letter": "c", "content": "all income of the company of that period incidental to and arising from any one or more of its petroleum operations; and" }, { "letter": "d", "content": "gains arising from the disposal of assets accruing to the company in any accounting period, ascertained in accordance with the relevant provisions of Part VIII of Chapter two of this Act which shall be taxable at the rate provided under section 56 of this Act." } ] }, { "number": "2", "content": "For the purposes of subsection (1)(b), the value of any chargeable oil disposed shall be taken to be the value of that oil in line with the applicable legislation." }, { "number": "3", "content": "The adjusted profit of an accounting period shall be the profits of that period after the deductions allowed under section 92(1) of this Act and any adjustment to be made in accordance with the provisions of sections 92(2) and 96 of this Act." }, { "number": "4", "content": "The assessable profit of an accounting period shall be the adjusted profit of that period after any deduction allowed under section 97 of this Act." }, { "number": "5", "content": "The chargeable profits of an accounting period shall be the assessable profits of that period after the deductions allowed under section 98 of this Act." } ] },
            { "number": "92", "title": "Deductions allowed", "subsections": [ { "number": "1", "content": "In computing the adjusted profit of a company for an accounting period from its petroleum operations, there shall be deducted all outgoings and expenses wholly and exclusively incurred, during the period by the company for the purpose of its operations, as follows –", "clauses": [ { "letter": "a", "content": "rents incurred by the company for that period in respect of land or buildings occupied under an oil prospecting licence or an oil mining lease for disturbance of surface rights or for any other like disturbance;" }, { "letter": "b", "content": "all non-productive rents incurred by the company during that period;" }, { "letter": "c", "content": "all royalties incurred by the company during that period in respect of natural gas sold and actually delivered to the Nigerian National Petroleum Company Limited, or sold to any other buyer or customer or disposed in any other commercial manner;" }, { "letter": "d", "content": "all royalties incurred by the company during the period in respect of crude oil or of casinghead petroleum spirit won in Nigeria;" }, { "letter": "e", "content": "customs or excise duty or other like charges in respect of machineries, equipment and goods used in the company's petroleum operation incurred by the company to the Federal Government of Nigeria during the period;" }, { "letter": "f", "content": "any expense incurred for repair of premises, plant machinery, or fixtures employed for the purpose of carrying on petroleum operations, or for the renewal, repair or alteration of any implement, utensils or articles employed;" }, { "letter": "g", "content": "interest incurred on money borrowed by such company where the Service is satisfied that the interest was payable on capital employed in carrying on its petroleum operations subject to the provisions of the Third Schedule to this Act and the Transfer Pricing Regulations;" }, { "letter": "h", "content": "any expenditure being intangible drilling costs directly incurred in connection with drilling and appraisal of a development well;" }, { "letter": "i", "content": "any expenditure (tangible or intangible) directly incurred in connection with the drilling of an exploration well and the next two appraisal wells in the same field whether the wells are productive or not, provided that where a deduction is made under this section in respect of any such expenditure, that expenditure shall not be treated as qualifying drilling expenditure for the purpose of Part III of the First Schedule to this Act ;" }, { "letter": "j", "content": "any contributions to pension, provident or other society, scheme or fund, which may be approved, under the Pensions Reform Act, provided that the sum received by or the value of any benefit obtained by such company, from any approved pension, provident or other society, scheme or fund, in any accounting period of that company shall, for the purpose of subsection (1)(c) of section 90 of this Act, be treated as income of the company for that accounting period;" }, { "letter": "k", "content": "customs and excise duties, stamp duties, or any other rate, fee or other like charges, other than any tax on income, incurred by the company during the period to the Federal Government, a State or Local Government;" }, { "letter": "l", "content": "any amount contributed to a fund, scheme or arrangement approved by the Commission for the purpose of decommissioning and abandonment, subject to the production of the statement of account of the Decommissioning and Abandonment Fund : Provided that the surplus or residue of the fund after decommissioning and abandonment of the field shall be subject to tax under this Part;" }, { "letter": "m", "content": "debts directly incurred to the company and proved to the satisfaction of the Service to have become bad or doubtful in the accounting period for which the adjusted profits is being ascertained, notwithstanding that such bad or doubtful debts were due and payable prior to the commencement of that period, provided that –", "items": [ { "number": "i", "content": "the debt was included as a profit from petroleum operations in the accounting period in which they were incurred or advances made in the normal course of carrying on petroleum operations not being advances on account of any item under section 97 of this Act," }, { "number": "ii", "content": "the deduction to be made in respect of a doubtful debt shall not exceed that portion of the debt which is proved to have become doubtful during that accounting period, and shall not include any amount deducted under the provisions of this paragraph in determining the adjusted profit of a previous accounting period, and" }, { "number": "iii", "content": "all sums recovered by the company during that accounting period on account of amounts previously deducted in respect of bad or doubtful debts shall be treated as income of the company for that period;" } ] }, { "letter": "n", "content": "development levy paid under section 59 of this Act ; and" }, { "letter": "o", "content": "such other deductions as may be prescribed by any rule made under this Part." } ] }, { "number": "2", "content": "Liability waived, released or recovered shall be treated under this Part in accordance with section 193 of this Act." } ] },
            { "number": "93", "title": "Incentives for utilisation of associated gas", "subsections": [ { "number": "1", "content": "The following incentives shall apply to a company engaged in the utilisation of associated gas –", "clauses": [ { "letter": "a", "content": "investment required to separate crude oil and gas from the reservoir into usable products shall be considered as part of the oil field development;" }, { "letter": "b", "content": "capital investment on facilities or equipment to deliver associated gas in usable form at utilisation or designated custody transfer points shall be treated for tax purposes, as part of the capital investment for oil development;" }, { "letter": "c", "content": "capital allowances, operating expenses and basis of tax assessment shall be subject to the provisions of this part and the tax incentives under the revised memorandum of understanding." } ] }, { "number": "2", "content": "The incentives specified under subsection (1) shall be subject to the following conditions –", "clauses": [ { "letter": "a", "content": "condensates extracted and re-injected into the crude oil stream shall be treated as oil, but those not re-injected shall be treated under existing tax arrangement;" }, { "letter": "b", "content": "the company shall pay the minimum amount charged by the Minister of Petroleum Resources for any gas flared by the company;" }, { "letter": "c", "content": "the company shall, as far as practicable, keep the expenses incurred in the utilisation of associated gas separate from those incurred on crude oil operation and expenses that cannot be separated shall be allowable against the crude oil income of the company under this Act;" }, { "letter": "d", "content": "expenses identified as incurred exclusively in the utilisation of associated gas shall be regarded as gas expenses and be allowable against the gas income and profit to be taxed under Chapter Two of this Act;" }, { "letter": "e", "content": "companies which invest in natural gas liquid extraction facilities to supply gas in usable form to downstream projects, including aluminium smelter and methanol, Methyl Tertiary Butyl Ether and other associated gas utilisation projects shall benefit from the incentives;" }, { "letter": "f", "content": "all capital investments relating to the gas-to-liquids facilities shall be treated as chargeable capital allowance and recovered against the crude oil income; and" }, { "letter": "g", "content": "gas transferred from the natural gas liquid facility to the gas-to-liquid facilities shall be at zero per cent tax and zero per cent royalty." } ] }, { "number": "3", "content": "Where a company has enjoyed any incentive under this section, the company shall not claim similar incentive under any law in Nigeria regarding the same investment or project, including economic development tax incentive and gas pipeline investment incentive under section 80 of this Act." } ] },
            { "number": "94", "title": "Application of incentives to utilisation of non-associated gas", "content": "All incentives granted in respect of investments in associated gas shall be applicable to investments in non-associated gas." },
            { "number": "95", "title": "Deductions not allowed", "subsections": [ { "number": "1", "content": "Subject to the provisions of this Part, for the purposes of ascertaining the adjusted profit of any company for any accounting period from its petroleum operations, no deduction shall be allowed in respect of –", "clauses": [ { "letter": "a", "content": "any capital withdrawn or any sum employed or intended to be employed as capital;" }, { "letter": "b", "content": "any capital employed in improvements as distinct from repairs;" }, { "letter": "c", "content": "any sum recoverable under an insurance or contract of indemnity;" }, { "letter": "d", "content": "rent of or cost of repairs to any premises or part of premises not incurred for the purposes of those operations;" }, { "letter": "e", "content": "any amount incurred in respect of any income tax, profits tax or other similar tax whether charged within Nigeria or elsewere;" }, { "letter": "f", "content": "the depreciation of any premises, buildings, structures, works of a permanent nature, plant, equipment, machinery, furniture or fixtures;" }, { "letter": "g", "content": "any payment to any pensions, provident, savings widows' and orphans' or other society scheme or fund, except such payments as are allowed under section 91 (1) (j) of this Act;" }, { "letter": "h", "content": "customs duty on goods, including articles or any other thing, imported by the company –", "items": [ { "number": "i", "content": "or resale or for personal consumption of employees of the company, or" }, { "number": "ii", "content": "where goods of the same quality to those imported are produced in Nigeria and are available for sale to the public at a price lower or equivalent to the cost of the imported goods at the time the imported goods were ordered by the company;" } ] }, { "letter": "i", "content": "any expenditure for the purchase of information relating to the existence and extent of petroleum deposits;" }, { "letter": "j", "content": "any qualifying expenditure for the purposes of Part III of the First Schedule to this Act, and any expense or deduction in respect of a liability incurred which is deductible under any other provision of this Act;" }, { "letter": "k", "content": "any tax or penalty borne on behalf of another person; and" }, { "letter": "l", "content": "any expense on which Value Added Tax is due under this Act but not charged, or in the case of imported items, any expense on which the applicable import duty or levy was not paid." } ] }, { "number": "2", "content": "Notwithstanding the provisions of section 92(1) of this Act, in computing the adjusted profit of any company of any accounting period, deduction shall not be allowed in respect of any sum incurred to a related party where the cost is not in accordance with the Transfer Pricing Regulations." } ] },
            { "number": "96", "title": "Exclusion of certain profits", "content": "Where a company engaged in petroleum operations is engaged in the transportation of chargeable oil by ocean going oil-tankers operated by or on behalf of the company from Nigeria to another territory, adjustments shall be made in computing an adjusted profit or a loss to exclude any profit or loss attributable to such transportation." },
            { "number": "97", "title": "Assessable profits and losses", "subsections": [ { "number": "1", "content": "Subject to the provisions of this section, the assessable profits of a company for any accounting period shall be the amount of the adjusted profit of that period after the deduction of –", "clauses": [ { "letter": "a", "content": "the amount of any loss incurred by that company during any previous accounting period; and" }, { "letter": "b", "content": "in a case of a business restructuring, the amount of any loss which is allowed for deduction by the new company under section 190 of this Act in its trade or business during its first accounting period." } ] }, { "number": "2", "content": "The loss referred to in subsection (1) shall be deducted to the extent possible from the amount of the adjusted profits of the accounting period immediately succeeding the accounting period in which the loss was incurred, and in subsequent accounting periods, until the loss is fully recouped." }, { "number": "3", "content": "Subject to the approval of the Service, a company may, within five months after the end of an accounting period, or such further time as the Service may permit, elect in writing, that a deduction to be made under this section, or part of the deduction, be deferred to succeeding accounting periods." } ] },
            { "number": "98", "title": "Chargeable profits and capital allowances", "subsections": [ { "number": "1", "content": "The chargeable profits of a company of any accounting period shall be the amount of the assessable profits of that period after the deduction of any amount to be allowed in accordance with the provisions of this section." }, { "number": "2", "content": "There shall be computed the aggregate amount of all allowances due to the company under the provisions of Part III of the First Schedule to this Act for the accounting period." }, { "number": "3", "content": "In calculating the amount of the deduction to be allowed under this section for an accounting period, the limitation imposed by subsection(4) shall be applied to ensure that the tax chargeable on the company for that period is not less than 15% of the tax chargeable for the period, where no deduction is made under this section." }, { "number": "4", "content": "The amount to be allowed as a deduction under this section shall be, the lower of –", "clauses": [ { "letter": "a", "content": "the aggregate amount computed under subsection (2); or" }, { "letter": "b", "content": "a sum equal to 85% of the assessable profits of the accounting period less 170% of the total amount of the deduction allowed as petroleum investment allowance computed under Part III of the First Schedule to this Act for the period." } ] }, { "number": "5", "content": "Where the total amount of the allowances computed under subsection (2) cannot be deducted under subsection (1) due to insufficiency of or no assessable profits for the accounting period or to the limitation imposed by subsection (4) the total amount or the part which has not been deducted, shall be –", "clauses": [ { "letter": "a", "content": "added to the aggregate amount to be computed under subsection (2) for the succeeding accounting period of the company; and" }, { "letter": "b", "content": "deemed to be an allowance due to the company, under the provisions of Part III of the First Schedule to this Act for that succeeding accounting period." } ] }, { "number": "6", "content": "Where Value Added Tax is due under this Act but not charged on an asset, or in the case of an imported item, the applicable import duty or levy was not paid, the relevant expenditure shall not be eligible as a qualifying capital expenditure under the provisions of Part III of First Schedule to this Act." } ] },
            { "number": "99", "title": "Assessable petroleum profits tax", "subsections": [ { "number": "1", "content": "The assessable tax for an accounting period of a company shall be an amount equal to 85% of its chargeable profits of that period." }, { "number": "2", "content": "Where a company has not commenced a sale or bulk disposal of chargeable oil under a programme of continuous production, its assessable tax for an accounting period during which it has not fully amortised all its pre-production capitalised expenditure, shall be 65.75% of the chargeable profits for that period : Provided that –", "clauses": [ { "letter": "a", "content": "the period of the tax rate under this subsection shall not be more than five years, commencing from the first accounting period of the company, notwithstanding any other incentive as may be granted to the company; and" }, { "letter": "b", "content": "where a company is granted a licence or lease or acquires an interest in an oil and gas asset that has enjoyed the provision of this subsection, the company shall be subject to tax under the provision of subsection (1) from its first accounting period." } ] } ] },
            { "number": "100", "title": "Additional chargeable tax payable in certain circumstances", "subsections": [ { "number": "1", "content": "Where, for any accounting period of a company, there is a sale of chargeable oil between connected persons, or disposal of chargeable oil between connected or unconnected persons, and the amount of the chargeable tax for that period, calculated in accordance with the provisions of this Part other than this section, is less than the amount prescribed in subsection (2), the company shall pay an additional amount of chargeable tax for that period, equal to the difference between those two amounts." }, { "number": "2", "content": "The amount referred to in subsection (1) is, for any accounting period of a company, the amount which the chargeable tax for that period, calculated in accordance with the provisions of this Part, shall be, if the reference in section 91 (1) (a) and (b) of this Act to the proceeds of sale were a reference to the amount obtained by multiplying the number of barrels of that crude oil determined at the measurement point by the fiscal oil price per barrel." }, { "number": "3", "content": "For the purpose of this section, the total value of the chargeable oil for a company shall be the sum of the multiplications of volume and fiscal oil price as established by the Commission at the measurement point." }, { "number": "4", "content": "The whole of any additional chargeable tax for crude oil payable by a company under this section for any accounting period shall be payable concurrently with the final instalment of the chargeable tax payable for that period." }, { "number": "5", "content": "Where there is no fiscal oil price established for a crude oil stream, the Commission shall establish fiscal price for such stream and the fiscal oil price per barrel established shall bear a fair and reasonable relationship –", "clauses": [ { "letter": "a", "content": "to the established fiscal oil price of Nigerian crude oil streams of comparable quality and specific gravity; or" }, { "letter": "b", "content": "where there are no such Nigerian crude oil streams of comparable quality and specific gravity, it shall bear a fair and reasonable relationship to the official selling prices at main international trading centres for crude oil of comparable quality and gravity, due regard being had in either case to freight differentials and other relevant factors." } ] }, { "number": "6", "content": "Notwithstanding any other provision in this Part, where a particular company's chargeable oil is exported from Nigeria or sold locally by another company, that chargeable oil for the purpose of this Part shall be deemed to be exported from Nigeria or sold by that particular company." } ] }
          ]
        }
      ]
    }
  ]
}
